{"2122": {"bookid": "2122", "title": "The Fountainhead", "author": "Ayn Rand", "series": "", "ratings": "309376", "reviews": "13106", "rating": "3.88", "description": "The revolutionary literary vision that sowed the seeds of Objectivism, Ayn Rand's groundbreaking philosophy, and brought her immediate worldwide acclaim.This modern classic is the story of intransigent young architect Howard Roark, whose integrity was as unyielding as granite...of Dominique Francon, the exquisitely beautiful woman who loved Roark passionately, but married \nThe revolutionary literary vision that sowed the seeds of Objectivism, Ayn Rand's groundbreaking philosophy, and brought her immediate worldwide acclaim.This modern classic is the story of intransigent young architect Howard Roark, whose integrity was as unyielding as granite...of Dominique Francon, the exquisitely beautiful woman who loved Roark passionately, but married his worst enemy...and of the fanatic denunciation unleashed by an enraged society against a great creator. As fresh today as it was then, Rand’s provocative novel presents one of the most challenging ideas in all of fiction—that man’s ego is the fountainhead of human progress...“A writer of great power. She has a subtle and ingenious mind and the capacity of writing brilliantly, beautifully, bitterly...This is the only novel of ideas written by an American woman that I can recall.”—The New York Times\n", "genres": ["Classic Literature", "Literary Fiction", "Novels", "Architecture", "Philosophy", "Politics", "American", "Fiction", "Literature", "Classics"]}, "29844228": {"bookid": "29844228", "title": "Thirteen Reasons Why", "author": "Jay Asher", "series": "", "ratings": "875512", "reviews": "53966", "rating": "3.87", "description": "You can’t stop the future. You can’t rewind the past.The only way to learn the secret . . . is to press play.Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker–his classmate and crush–who committed suicide two weeks earlier. Hannah’s voice tells him that \nYou can’t stop the future. You can’t rewind the past.The only way to learn the secret . . . is to press play.Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker–his classmate and crush–who committed suicide two weeks earlier. Hannah’s voice tells him that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he’ll find out why. Clay spends the night crisscrossing his town with Hannah as his guide. He becomes a firsthand witness to Hannah’s pain, and as he follows Hannah’s recorded words throughout his town, what he discovers changes his life forever.\n", "genres": ["Teen", "Young Adult", "Health", "Mystery", "Audiobook", "Mental Health", "High School", "Realistic Fiction", "Contemporary", "Fiction", "Romance"]}, "249": {"bookid": "249", "title": "Tropic of Cancer", "author": "Henry Miller", "series": "(Tropic #1)", "ratings": "67429", "reviews": "3644", "rating": "3.68", "description": "Now hailed as an American classic Tropic of Cancer, Henry Miller’s masterpiece, was banned as obscene in this country for twenty-seven years after its first publication in Paris in 1934. Only a historic court ruling that changed American censorship standards, ushering in a new era of freedom and frankness in modern literature, permitted the publication of this first volume\nNow hailed as an American classic Tropic of Cancer, Henry Miller’s masterpiece, was banned as obscene in this country for twenty-seven years after its first publication in Paris in 1934. Only a historic court ruling that changed American censorship standards, ushering in a new era of freedom and frankness in modern literature, permitted the publication of this first volume of Miller’s famed mixture of memoir and fiction, which chronicles with unapologetic gusto the bawdy adventures of a young expatriate writer, his friends, and the characters they meet in Paris in the 1930s. Tropic of Cancer is now considered, as Norman Mailer said, \"one of the ten or twenty great novels of our century.\"\n", "genres": ["Literary Fiction", "Novels", "Banned Books", "20th Century", "American", "Erotica", "Cultural", "Fiction", "Literature", "Classics", "Adult Fiction", "France"]}, "92307": {"bookid": "92307", "title": "Being and Time", "author": "Martin Heidegger", "series": "", "ratings": "22073", "reviews": "661", "rating": "4.04", "description": "One of the most important philosophical works of our time, a work that has had tremendous influence on philosophy, literature, and psychology, and has literally changed the intellectual map of the modern", "genres": ["Nonfiction", "Theory", "European Literature", "German Literature", "Psychology", "Philosophy", "Academic", "Cultural", "Metaphysics", "Germany", "Classics", "Science"]}, "12172": {"bookid": "12172", "title": "Memoirs of Hadrian", "author": "Marguerite Yourcenar", "series": "", "ratings": "23268", "reviews": "1993", "rating": "4.24", "description": "Both an exploration of character and a reflection on the meaning of history, Memoirs of Hadrian has received international acclaim since its first publication in France in 1951. In it, Marguerite Yourcenar reimagines the Emperor Hadrian's arduous boyhood, his triumphs and reversals, and finally, as emperor, his gradual reordering of a war-torn world, writing with the imagi\nBoth an exploration of character and a reflection on the meaning of history, Memoirs of Hadrian has received international acclaim since its first publication in France in 1951. In it, Marguerite Yourcenar reimagines the Emperor Hadrian's arduous boyhood, his triumphs and reversals, and finally, as emperor, his gradual reordering of a war-torn world, writing with the imaginative insight of a great writer of the twentieth century while crafting a prose style as elegant and precise as those of the Latin stylists of Hadrian's own era.\n", "genres": ["European Literature", "Novels", "Literature", "Philosophy", "LGBT", "Cultural", "Historical", "French Literature", "Fiction", "Historical Fiction", "Classics", "France"]}, "16171291": {"bookid": "16171291", "title": "The Silent Wife", "author": "A.S.A. Harrison", "series": "", "ratings": "106786", "reviews": "10167", "rating": "3.31", "description": "A chilling psychological thriller portraying the disintegration of a relationship down to the deadliest point when murdering your husband suddenly makes perfect sense. Todd Gilbert and Jodie Brett are in a bad place in their relationship. They've been together for twenty-eight years, and with no children to worry about there has been little to disrupt their affluent Chicag\nA chilling psychological thriller portraying the disintegration of a relationship down to the deadliest point when murdering your husband suddenly makes perfect sense. Todd Gilbert and Jodie Brett are in a bad place in their relationship. They've been together for twenty-eight years, and with no children to worry about there has been little to disrupt their affluent Chicago lifestyle. But there has also been little to hold it together, and beneath the surface lie ever-widening cracks. HE is a committed cheater. SHE lives and breathes denial. HE exists in dual worlds. SHE likes to settle scores. HE decides to play for keeps. SHE has nothing left to lose. When it becomes clear that their precarious world could disintegrate at any moment, Jodie knows she stands to lose everything. It's only now she will discover just how much she's truly capable of...\n", "genres": ["Mystery", "Crime", "Mystery Thriller", "Adult", "Audiobook", "Suspense", "Psychological Thriller", "Thriller", "Fiction", "Contemporary"]}, "841628": {"bookid": "841628", "title": "The Hitchhiker's Guide to the Galaxy: A Trilogy in Four Parts", "author": "Douglas Adams", "series": "(The Hitchhiker's Guide to the Galaxy #1-4)", "ratings": "35296", "reviews": "570", "rating": "4.50", "description": "Charting the whole of Arthur Dent's odyssey through space are:THE HITCHHIKER'S GUIDE TO THE GALAXY.One Thursday lunchtime the Earth gets unexpectedly demolished to make way for a new hyperspace bypass. For Arthur Dent, who has only just had his house demolished that morning, this seems already to be more than he can cope with. Sadly, however, the weekend has only just begu\nCharting the whole of Arthur Dent's odyssey through space are:THE HITCHHIKER'S GUIDE TO THE GALAXY.One Thursday lunchtime the Earth gets unexpectedly demolished to make way for a new hyperspace bypass. For Arthur Dent, who has only just had his house demolished that morning, this seems already to be more than he can cope with. Sadly, however, the weekend has only just begun, and the Galaxy is a very very very large and startling place.THE RESTAURANT AT THE END OF THE UNIVERSE.When all questions of space, time, matter and the nature of being have been resolved, only one question remains --- \"Where shall we have dinner?\" The Restaurant at the End of the Universe provides the ultimate gastronomic experience, and for once there is no morning after to worry about.LIFE, THE UNIVERSE AND EVERYTHING.In consequence of a number of stunning catastrophes, Arthur Dent is surprised to find himself living in a hideously miserable cave on prehistoric Earth. However, just as he thinks that things cannot possibly get any worse, they suddenly do. He discovers that the Galaxy is not only mind-boggling big and bewildering but also that most of the things that happen in it are staggeringly unfair.SO LONG, AND THANKS FOR ALL THE FISH.Just as Arthur Dent's sense of reality is in its dickiest state he suddenly finds the girl of his dreams. He finds her in the last place in the Universe in which he would expect to find anything at all, but which 3,976,000 people will find oddly familiar. They go in search of God's Final Message to His Creation and, in a dramatic break with tradition, actually find it.\n", "genres": ["Comedy", "Science Fiction", "European Literature", "Adventure", "Novels", "Humor", "Fantasy", "Science Fiction Fantasy", "British Literature", "Fiction", "Classics"]}}