{"13573236": {"bookid": "13573236", "title": "The Racketeer", "author": "John Grisham", "series": "", "ratings": "95888", "reviews": "8115", "rating": "3.85", "description": "Given the importance of what they do, and the controversies that often surround them, and the violent people they sometimes confront, it is remarkable that in the history of this country only four active federal judges have been murdered.Judge Raymond Fawcett has just become number five.Who is the Racketeer? And what does he have to do with the judge’s untimely demise? His\nGiven the importance of what they do, and the controversies that often surround them, and the violent people they sometimes confront, it is remarkable that in the history of this country only four active federal judges have been murdered.Judge Raymond Fawcett has just become number five.Who is the Racketeer? And what does he have to do with the judge’s untimely demise? His name, for the moment, is Malcolm Bannister. Job status? Former attorney. Current residence? The Federal Prison Camp near Frostburg, Maryland.On paper, Malcolm’s situation isn’t looking too good these days, but he’s got an ace up his sleeve. He knows who killed Judge Fawcett, and he knows why. The judge’s body was found in his remote lakeside cabin. There was no forced entry, no struggle, just two dead bodies: Judge Fawcett and his young secretary. And one large, state-of-the-art, extremely secure safe, opened and emptied.What was in the safe? The FBI would love to know. And Malcolm Bannister would love to tell them. But everything has a price—especially information as explosive as the sequence of events that led to Judge Fawcett’s death. And the Racketeer wasn’t born yesterday . . .Nothing is as it seems and everything’s fair game in this wickedly clever new novel from John Grisham, the undisputed master of the legal thriller.\n", "genres": ["Novels", "Mystery", "Suspense", "Crime", "Audiobook", "Fiction", "Legal Thriller", "Thriller", "Adult", "Mystery Thriller"]}, "677877": {"bookid": "677877", "title": "Being There", "author": "Jerzy Kosiński", "series": "", "ratings": "12103", "reviews": "1043", "rating": "3.86", "description": "A modern classic now available from Grove Press, Being There is one of the most popular and significant works from a writer of international stature. It is the story of Chauncey Gardiner - Chance, an enigmatic but distinguished man who emerges from nowhere to become an heir to the throne of a Wall Street tycoon, a presidential policy adviser, and a media icon. Truly \"a man\nA modern classic now available from Grove Press, Being There is one of the most popular and significant works from a writer of international stature. It is the story of Chauncey Gardiner - Chance, an enigmatic but distinguished man who emerges from nowhere to become an heir to the throne of a Wall Street tycoon, a presidential policy adviser, and a media icon. Truly \"a man without qualities,\" Chance's straightforward responses to popular concerns are heralded as visionary. But though everyone is quoting him, no one is sure what he's really saying. And filling in the blanks in his background proves impossible. Being There is a brilliantly satiric look at the unreality of American media culture that is, if anything, more trenchant now than ever.\n", "genres": ["Novels", "Literature", "Politics", "Audiobook", "Fiction", "Literary Fiction", "Philosophy", "Classics", "20th Century", "Humor"]}, "16372": {"bookid": "16372", "title": "The Mirror Crack'd from Side to Side", "author": "Agatha Christie", "series": "(Miss Marple #8)", "ratings": "38841", "reviews": "1882", "rating": "3.94", "description": "One minute, silly Heather Badcock had been gabbing on to her movie idol, the glamorous Marina Gregg. The next, Heather suffered a massive seizure. It turned out to be a deadly poison. But for whom was it really intended?Marina’s frozen expression suggested she had witnessed something horrific. While others searched for material evidence, Jane Marple conducted a very differ\nOne minute, silly Heather Badcock had been gabbing on to her movie idol, the glamorous Marina Gregg. The next, Heather suffered a massive seizure. It turned out to be a deadly poison. But for whom was it really intended?Marina’s frozen expression suggested she had witnessed something horrific. While others searched for material evidence, Jane Marple conducted a very different investigation – into human nature.Librarian's note: this entry is for the novel, \"The Mirror Crack'd from Side to Side.\" Collections and other Miss Marple stories are located elsewhere on Goodreads. The series includes 12 novels and 20 short stories. Entries for the short stories can be found by searching Goodreads for: \"a Miss Marple Short Story.\"\n", "genres": ["Mystery", "Crime", "British Literature", "Murder Mystery", "Audiobook", "Fiction", "European Literature", "Cozy Mystery", "Thriller", "Mystery Thriller", "Classics", "Detective"]}, "40406714": {"bookid": "40406714", "title": "Going Off Grid", "author": "Dave  Lewis", "series": "", "ratings": "9", "reviews": "3", "rating": "4.89", "description": "This contemporary collection by one of Wales’ most prolific poets focuses on digital capitalism, the negative influence of big tech and our addiction to data. Lewis is deeply concerned with the negative direction mankind is taking and cares passionately about helping to steer us all back to a far simpler, happier place in the far more important offline world. Death and dep\nThis contemporary collection by one of Wales’ most prolific poets focuses on digital capitalism, the negative influence of big tech and our addiction to data. Lewis is deeply concerned with the negative direction mankind is taking and cares passionately about helping to steer us all back to a far simpler, happier place in the far more important offline world. Death and depression, as well as love and nature, are also ever-present themes and the whole package is tightly woven together with some subtle, yet haunting, photographs. “An epic tour de force of modern poetry. The opening poem, (Diet), is reminiscent of T. S. Eliot's 'The Waste Land' and this author's ‘Roadkill‘, but this time focuses on digital capitalism. Lewis is primarily concerned with the madness and addiction pervading our online worlds while we neglect the more important offline. The title is a hope rather than a statement.“The book includes a handful of vignettes and reflections of the author's immediate locale edited in the style of Julia Margaret Cameron that provide an added texture and insight to the text. Another piece of top drawer writing by one of Wales's best poets.” - Andrew Davies\n", "genres": []}, "50391716": {"bookid": "50391716", "title": "The Creation of Me, Them and Us", "author": "Heather  Marsh", "series": "", "ratings": "22", "reviews": "0", "rating": "4.64", "description": "From the author of Binding Chaos, this book brings us back to the beginning. The beginning of designing a better method of governance and way of living is to look at the structure of our self. The scope and originality of this book present a radical challenge to a seldom examined worldview. With an extremely wide reach and richness of detail, The Creation of Me, Them and U\nFrom the author of Binding Chaos, this book brings us back to the beginning. The beginning of designing a better method of governance and way of living is to look at the structure of our self. The scope and originality of this book present a radical challenge to a seldom examined worldview. With an extremely wide reach and richness of detail, The Creation of Me, Them and Us sets the stage for further discussions of institutional reform by tackling the fundamental questions of who are we, what do we want, and why do we act the way we do? These questions (and answers) are fundamental in understanding a world that may seem incomprehensible today.\n", "genres": ["Psychology", "Nonfiction", "Politics", "Education"]}, "52013535": {"bookid": "52013535", "title": "Remnants of Atonement (True paths #1)", "author": "G.P. McKenna", "series": "", "ratings": "159", "reviews": "81", "rating": "4.14", "description": "*A gothic tale on the dangers of obsession with the past.* Kilco Escamilla is bored of the humdrum life she leads, and it's all thanks to the incident that shall not be named which still sends her tough as nails mother, Doctor Kira, running for refuge with a bottle of whiskey at the merest mention. When her mother receives a request to become the royal physician in the nei\n*A gothic tale on the dangers of obsession with the past.* Kilco Escamilla is bored of the humdrum life she leads, and it's all thanks to the incident that shall not be named which still sends her tough as nails mother, Doctor Kira, running for refuge with a bottle of whiskey at the merest mention. When her mother receives a request to become the royal physician in the neighbouring Kingdom's war camp at the base of the Armoury, a colossal tree in which all of Ascot's races gather to determine their shared fate, Kilco is desperate for her mother to let her tag along. Once there, Kilco soon finds more adventure than she bargained for when an injured patient is brought to the infirmary. Kilco has to stay in quarantine with Ilya, a red-eyed assassin eternally indebted to Ascot's Royal family, and the two soon become fast friends. Their relationship begins to change as Ilya heals and is preparing to leave the infirmary. Kilco is approached by a stranger who offers her a way to keep Ilya by her side forever.  An offer that will turn their lives upside down forever.\n", "genres": ["Young Adult", "Horror", "Fantasy", "LGBT", "Gothic Horror"]}, "20903135": {"bookid": "20903135", "title": "The Crazy Life of a Kid from Brooklyn", "author": "Bill Morgenstein", "series": "", "ratings": "106", "reviews": "23", "rating": "4.47", "description": "My dream then was to play baseball for the New York Yankees. I was on the Stuyvesant baseball team, but because of my working hours, my playing time was limited. My first dream to become a corporate president by the time I was 35 years of age was fulfilled.Experience the ups and downs of a life well lived in Bill Morgenstein's compelling new memoir, The Crazy Life of a Kid\nMy dream then was to play baseball for the New York Yankees. I was on the Stuyvesant baseball team, but because of my working hours, my playing time was limited. My first dream to become a corporate president by the time I was 35 years of age was fulfilled.Experience the ups and downs of a life well lived in Bill Morgenstein's compelling new memoir, The Crazy Life of a Kid from Brooklyn.While first reminiscing upon his childhood in Brooklyn during the depression, Morgenstein traces his life through times of war, peace, and everything in between.At times extremely funny and heartbreaking, The Crazy Life of a Kid in Brooklyn details Morgenstein's enlistment in the US Army, his days running a $55 million dollar company, his despair at losing it all to a scam, and much more.His chance encounters with such historical figures as Sergeant York, Cordell Hull, Sid Gordon, Jomo Kenyatta, and Vince Camuto provide amusing cultural touchstones that reveal a willingness to embrace everything life has to offer.Through all the successful, disappointing, dangerous, educational, and enlightening experiences that have shaped his life, Morgenstein remains philosophical as he explores the roles of ethics, honesty, and unfailing determination in shaping the human experience.\n", "genres": ["Drama"]}, "18869972": {"bookid": "18869972", "title": "The House on the Strand", "author": "Daphne du Maurier", "series": "", "ratings": "10948", "reviews": "1180", "rating": "3.84", "description": "Dick Young is lent a house in Cornwall by his friend Professor Magnus Lane. During his stay he agrees to serve as a guinea pig for a new drug that Magnus has discovered in his scientific research. When Dick samples Magnus's potion, he finds himself doing the impossible: traveling through time while staying in place, thrown all the way back into Medieval Cornwall. The conco\nDick Young is lent a house in Cornwall by his friend Professor Magnus Lane. During his stay he agrees to serve as a guinea pig for a new drug that Magnus has discovered in his scientific research. When Dick samples Magnus's potion, he finds himself doing the impossible: traveling through time while staying in place, thrown all the way back into Medieval Cornwall. The concoction wear off after several hours, but its effects are intoxicating and Dick cannot resist his newfound powers. As his journeys increase, Dick begins to resent the days he must spend in the modern world, longing ever more fervently to get back into his world of centuries before, and the home of the beautiful Lady Isolda...\n", "genres": ["Mystery", "Time Travel", "Historical Fiction", "Fantasy", "British Literature", "Fiction", "European Literature", "Classics", "Gothic", "Science Fiction", "Historical"]}, "269389": {"bookid": "269389", "title": "He Still Moves Stones: Everyone Needs a Miracle", "author": "Max Lucado", "series": "", "ratings": "5560", "reviews": "145", "rating": "4.28", "description": "It's what happens when obstacles prevent you from seeing what God has done for you ...He still moves stones.People with questions. The Bible is absolutely full of them. A crook on a cross. A wild man in a cemetery. A five-time divorcee. A despondent cripple. A grieving sister. A father at the end of his rope.Why are these portraits in the Bible? So we can look back in amaz\nIt's what happens when obstacles prevent you from seeing what God has done for you ...He still moves stones.People with questions. The Bible is absolutely full of them. A crook on a cross. A wild man in a cemetery. A five-time divorcee. A despondent cripple. A grieving sister. A father at the end of his rope.Why are these portraits in the Bible? So we can look back in amazement at what Jesus did? No ... these aren't just Sunday school stories. They are historic moments in which a real God met real pain so we could answer the question. \"Does God care when I hurt?\"On every page of this powerfully moving book, Max Lucado reminds us, the God who spoke to Moses at the burning bush still speaks loudly to you today. The God who forgave King David still offers you forgiveness. The God who helped men and women in ages past still comes into your world, and he comes to do what you can't, to move the stone away so you can see his answer.\n", "genres": ["Christianity", "Spirituality", "Faith", "Inspirational", "Christian Living", "Christian", "Christian Non Fiction", "Theology", "Religion", "Nonfiction"]}, "7747064": {"bookid": "7747064", "title": "The Iron Daughter", "author": "Julie Kagawa", "series": "(The Iron Fey #2)", "ratings": "124207", "reviews": "5863", "rating": "4.07", "description": "Half Summer faery princess, half human, Meghan has never fit in anywhere. Deserted by the Winter prince she thought loved her, she is prisoner to the Winter faery queen. As war looms between Summer and Winter, Meghan knows that the real danger comes from the Iron fey—ironbound faeries that only she and her absent prince have seen. But no one believes her.Worse, Meghan's ow\nHalf Summer faery princess, half human, Meghan has never fit in anywhere. Deserted by the Winter prince she thought loved her, she is prisoner to the Winter faery queen. As war looms between Summer and Winter, Meghan knows that the real danger comes from the Iron fey—ironbound faeries that only she and her absent prince have seen. But no one believes her.Worse, Meghan's own fey powers have been cut off. She's stuck in Faery with only her wits for help. Trusting anyone would be foolish. Trusting a seeming traitor could be deadly. But even as she grows a backbone of iron, Meghan can't help but hear the whispers of longing in her all-too-human heart.\n", "genres": ["Urban Fantasy", "Young Adult", "Fantasy", "Romance", "Fiction", "Fae", "Paranormal", "Young Adult Fantasy", "Magic", "Fairies"]}, "21326": {"bookid": "21326", "title": "Fables, Vol. 1: Legends in Exile", "author": "Bill Willingham", "series": "(Fables #1)", "ratings": "136459", "reviews": "3622", "rating": "3.97", "description": "When a savage creature known only as the Adversary conquered the fabled lands of legends and fairy tales, all of the infamous inhabitants of folklore were forced into exile. Disguised among the normal citizens of modern-day New York, these magical characters have created their own peaceful and secret society within an exclusive luxury apartment building called Fabletown. B\nWhen a savage creature known only as the Adversary conquered the fabled lands of legends and fairy tales, all of the infamous inhabitants of folklore were forced into exile. Disguised among the normal citizens of modern-day New York, these magical characters have created their own peaceful and secret society within an exclusive luxury apartment building called Fabletown. But when Snow White's party-girl sister, Rose Red, is apparently murdered, it is up to Fabletown's sheriff, a reformed and pardoned Big Bad Wolf (Bigby Wolf), to determine if the killer is Bluebeard, Rose's ex-lover and notorious wife killer, or Jack, her current live-in boyfriend and former beanstalk-climber.Collecting: Fables 1-5\n", "genres": ["Graphic Novels", "Mystery", "Urban Fantasy", "Graphic Novels Comics", "Fairy Tales", "Folk Tales", "Fantasy", "Comic Book", "Fables", "Comics", "Sequential Art", "Fiction"]}, "6621424": {"bookid": "6621424", "title": "Twenty-Five Years Ago Today", "author": "Stacy Juba", "series": "", "ratings": "545", "reviews": "127", "rating": "3.73", "description": "Kris Langley has always been obsessed with murder. She blames herself for the violent death of her cousin when they were kids and has let guilt invade every corner of her existence. Now an editorial assistant and obit writer for a Massachusetts newspaper, Kris stumbles across an unsolved murder while compiling \"25 Years Ago Today\" items from the microfilm. She grows fascin\nKris Langley has always been obsessed with murder. She blames herself for the violent death of her cousin when they were kids and has let guilt invade every corner of her existence. Now an editorial assistant and obit writer for a Massachusetts newspaper, Kris stumbles across an unsolved murder while compiling \"25 Years Ago Today\" items from the microfilm. She grows fascinated with the case of a young cocktail waitress who was bludgeoned to death and dumped in the woods. Determined to solve the case and atone for the death of her cousin, Kris immerses herself in the mystery of what happened to Diana Ferguson, a talented artist who expressed herself through haunting paintings of Greek mythology. Not only does Kris face resistance from her family and her managing editor, she also clashes with Diana's suspicious nephew, Eric Soares - until neither she nor Eric can deny the chemistry flaring between them. Kris soon learns that old news never leaves the morgue and that yesterday's headline is tomorrow's danger, for finding out the truth about that night twenty-five years ago may shatter Kris's present, costing her love, her career, and ultimately, her life.\n", "genres": ["Mystery", "Contemporary Romance", "Suspense", "Romantic Suspense", "Fiction", "Contemporary", "Cozy Mystery", "Thriller", "Mystery Thriller", "Romance"]}, "15839984": {"bookid": "15839984", "title": "Cruel Beauty", "author": "Rosamund Hodge", "series": "(Cruel Beauty Universe)", "ratings": "86307", "reviews": "10978", "rating": "3.67", "description": "Since birth, Nyx has been betrothed to the evil ruler of her kingdom-all because of a foolish bargain struck by her father. And since birth, she has been in training to kill him.With no choice but to fulfill her duty, Nyx resents her family for never trying to save her and hates herself for wanting to escape her fate. Still, on her seventeenth birthday, Nyx abandons everyt\nSince birth, Nyx has been betrothed to the evil ruler of her kingdom-all because of a foolish bargain struck by her father. And since birth, she has been in training to kill him.With no choice but to fulfill her duty, Nyx resents her family for never trying to save her and hates herself for wanting to escape her fate. Still, on her seventeenth birthday, Nyx abandons everything she's ever known to marry the all-powerful, immortal Ignifex. Her plan? Seduce him, destroy his enchanted castle, and break the nine-hundred-year-old curse he put on her people.But Ignifex is not at all what Nyx expected. The strangely charming lord beguiles her, and his castle—a shifting maze of magical rooms—enthralls her.As Nyx searches for a way to free her homeland by uncovering Ignifex's secrets, she finds herself unwillingly drawn to him. Even if she could bring herself to love her sworn enemy, how can she refuse her duty to kill him? With time running out, Nyx must decide what is more important: the future of her kingdom, or the man she was never supposed to love.\n", "genres": ["Fairy Tales", "Young Adult", "Mythology", "Fantasy", "Fiction", "Retellings", "Paranormal", "Young Adult Fantasy", "Magic", "Romance"]}, "260791": {"bookid": "260791", "title": "The Pursuit of Holiness", "author": "Jerry Bridges", "series": "", "ratings": "21152", "reviews": "530", "rating": "4.31", "description": "\"Be holy, for I am holy\" commands God to His people. But holiness is something that is often missed in the Christian's daily life. According to author Jerry Bridges, that's because we're not exactly sure what our part in holiness is. In The Pursuit of Holiness, he helps us see clearly just what we should rely on God to do--and what we should accept responsibility for ourse\n\"Be holy, for I am holy\" commands God to His people. But holiness is something that is often missed in the Christian's daily life. According to author Jerry Bridges, that's because we're not exactly sure what our part in holiness is. In The Pursuit of Holiness, he helps us see clearly just what we should rely on God to do--and what we should accept responsibility for ourselves.\n", "genres": ["Discipleship", "Christianity", "Spirituality", "Faith", "Christian Living", "Christian", "Christian Non Fiction", "Theology", "Religion", "Nonfiction"]}, "52670": {"bookid": "52670", "title": "One, Two, Three...Infinity: Facts and Speculations of Science", "author": "George Gamow", "series": "", "ratings": "3485", "reviews": "163", "rating": "4.20", "description": "\". . . full of intellectual treats and tricks, of whimsy and deep scientific philosophy. It is highbrow entertainment at its best, a teasing challenge to all who aspire to think about the universe.\" — New York Herald TribuneOne of the world's foremost nuclear physicists (celebrated for his theory of radioactive decay, among other accomplishments), George Gamow possessed th\n\". . . full of intellectual treats and tricks, of whimsy and deep scientific philosophy. It is highbrow entertainment at its best, a teasing challenge to all who aspire to think about the universe.\" — New York Herald TribuneOne of the world's foremost nuclear physicists (celebrated for his theory of radioactive decay, among other accomplishments), George Gamow possessed the unique ability of making the world of science accessible to the general reader.He brings that ability to bear in this delightful expedition through the problems, pleasures, and puzzles of modern science. Among the topics scrutinized with the author's celebrated good humor and pedagogical prowess are the macrocosm and the microcosm, theory of numbers, relativity of space and time, entropy, genes, atomic structure, nuclear fission, and the origin of the solar system.In the pages of this book readers grapple with such crucial matters as whether it is possible to bend space, why a rocket shrinks, the \"end of the world problem,\" excursions into the fourth dimension, and a host of other tantalizing topics for the scientifically curious. Brimming with amusing anecdotes and provocative problems, One Two Three . . . Infinity also includes over 120 delightful pen-and-ink illustrations by the author, adding another dimension of good-natured charm to these wide-ranging explorations.Whatever your level of scientific expertise, chances are you'll derive a great deal of pleasure, stimulation, and information from this unusual and imaginative book. It belongs in the library of anyone curious about the wonders of the scientific universe. \"In One Two Three . . . Infinity, as in his other books, George Gamow succeeds where others fail because of his remarkable ability to combine technical accuracy, choice of material, dignity of expression, and readability.\" — Saturday Review of Literature\n", "genres": ["Cultural", "Unfinished", "Popular Science", "Physics", "Science", "Nonfiction", "Mathematics", "Russia", "Philosophy", "Classics", "History"]}, "9436632": {"bookid": "9436632", "title": "Vanish", "author": "Sophie Jordan", "series": "(Firelight #2)", "ratings": "32094", "reviews": "2205", "rating": "3.91", "description": "An impossible romance.Bitter rivalries.Deadly choices.To save the life of the boy she loves, Jacinda did the unthinkable: She betrayed the most closely-guarded secret of her kind. Now she must return to the protection of her pride knowing she might never see Will again—and worse, that because his mind has been shaded, Will’s memories of that fateful night and why she had t\nAn impossible romance.Bitter rivalries.Deadly choices.To save the life of the boy she loves, Jacinda did the unthinkable: She betrayed the most closely-guarded secret of her kind. Now she must return to the protection of her pride knowing she might never see Will again—and worse, that because his mind has been shaded, Will’s memories of that fateful night and why she had to flee are gone.Back home, Jacinda is greeted with hostility and must work to prove her loyalty for both her sake and her family’s. Among the few who will even talk to her are Cassian, the pride’s heir apparent who has always wanted her, and her sister, Tamra, who has been forever changed by a twist of fate. Jacinda knows that she should forget Will and move on—that if he managed to remember and keep his promise to find her, it would only endanger them both. Yet she clings to the hope that someday they will be together again. When the chance arrives to follow her heart, will she risk everything for love?\n", "genres": ["Urban Fantasy", "Paranormal Romance", "Young Adult", "Fantasy", "Dragons", "Supernatural", "Paranormal", "Shapeshifters", "Magic", "Romance"]}, "25622296": {"bookid": "25622296", "title": "Strangers on a Train", "author": "Patricia Highsmith", "series": "", "ratings": "25772", "reviews": "2408", "rating": "3.76", "description": "Just in time for the centennial celebration of groundbreaking noir fiction writer Patricia Highsmith comes a reissue of her propulsive, engrossing debut, Strangers on a Train, with a new introduction by best-selling author Paula Hawkins. Guy Haines and Charles Anthony Bruno are passengers on the same train. Haines is a successful architect in the midst of a divorce, Bruno \nJust in time for the centennial celebration of groundbreaking noir fiction writer Patricia Highsmith comes a reissue of her propulsive, engrossing debut, Strangers on a Train, with a new introduction by best-selling author Paula Hawkins. Guy Haines and Charles Anthony Bruno are passengers on the same train. Haines is a successful architect in the midst of a divorce, Bruno a mysterious smooth-talker with a sadistic proposal: he’ll murder Haines’s wife if Haines will murder Bruno’s father. As Bruno carries out his twisted plan, Guy finds himself trapped in Highsmith’s perilous world, where, under the right circumstances, ordinary people are capable of extraordinary crimes. The inspiration for Alfred Hitchcock’s classic 1951 film, Strangers on a Train launched Highsmith’s prolific career, proving her a master at depicting the unsettling forces that tremble beneath the surface of everyday life.\n", "genres": ["Mystery", "Suspense", "American", "Crime", "Literature", "Noir", "Audiobook", "Fiction", "Thriller", "Mystery Thriller", "Classics"]}, "12880": {"bookid": "12880", "title": "Black Lamb and Grey Falcon", "author": "Rebecca West", "series": "", "ratings": "2194", "reviews": "342", "rating": "4.22", "description": "Written on the brink of World War II, Rebecca West's classic examination of the history, people, and politics of Yugoslavia illuminates a region that is still a focus of international concern. A magnificent blend of travel journal, cultural commentary, and historical insight, Black Lamb and Grey Falcon probes the troubled history of the Balkans, and the uneasy relationship\nWritten on the brink of World War II, Rebecca West's classic examination of the history, people, and politics of Yugoslavia illuminates a region that is still a focus of international concern. A magnificent blend of travel journal, cultural commentary, and historical insight, Black Lamb and Grey Falcon probes the troubled history of the Balkans, and the uneasy relationships amongst its ethnic groups. The landscape and the people of Yugoslavia are brilliantly observed as West untangles the tensions that rule the country's history as well as its daily life.\n", "genres": ["Autobiography", "Memoir", "20th Century", "Literature", "Politics", "Historical", "Travel", "Nonfiction", "Classics", "Biography", "European History", "History"]}, "6470037": {"bookid": "6470037", "title": "Library of the Dead", "author": "Glenn Cooper", "series": "(Will Piper #1)", "ratings": "13519", "reviews": "1145", "rating": "3.79", "description": "The most shocking secret in the history of mankind is about to be revealed...A murderer is on the loose on the streets of New York City: nicknamed the Doomsday Killer, he's claimed six victims in just two weeks, and the city is terrified. Even worse, the police are mystified: the victims have nothing in common, defying all profiling, and all that connects them is that each\nThe most shocking secret in the history of mankind is about to be revealed...A murderer is on the loose on the streets of New York City: nicknamed the Doomsday Killer, he's claimed six victims in just two weeks, and the city is terrified. Even worse, the police are mystified: the victims have nothing in common, defying all profiling, and all that connects them is that each received a sick postcard in the mail before they died - a postcard that announced their date of death. In desperation, the FBI assigns the case to maverick agent Will Piper, once the most accomplished serial killing expert in the bureau's history, now on a dissolute spiral to retirement. Battling his own demons, Will is soon drawn back into a world he both loves and hates, determined to catch the killer whatever it takes. But his search takes him in a direction he could never have predicted, uncovering a shocking secret that has been closely guarded for centuries. A secret that once lay buried in an underground library beneath an 8th Century monastery, but which has now been unearthed - with deadly consequences. A select few defend the secret of the library with their lives - and as Will closes in on the truth, they are determined to stop him, at any cost...Some crimes should never be solved; some secrets are best left buried.Secret of the Seventh Son is a debut thriller by Glenn Cooper about predestination and fate.\n", "genres": ["Mystery", "Suspense", "Crime", "Historical Fiction", "Fantasy", "Fiction", "Thriller", "Mystery Thriller", "Historical", "Adventure"]}, "525488": {"bookid": "525488", "title": "Boundaries: When to Say Yes, How to Say No, to Take Control of Your Life", "author": "Henry Cloud", "series": "", "ratings": "64031", "reviews": "4036", "rating": "4.19", "description": "Having clear boundaries is essential to a healthy, balanced lifestyle. A boundary is a personal property line that marks those things for which we are responsible. In other words, boundaries define who we are and who we are not. Boundaries impact all areas of our lives: Physical boundaries help us determine who may touch us and under what circumstances -- Mental boundaries\nHaving clear boundaries is essential to a healthy, balanced lifestyle. A boundary is a personal property line that marks those things for which we are responsible. In other words, boundaries define who we are and who we are not. Boundaries impact all areas of our lives: Physical boundaries help us determine who may touch us and under what circumstances -- Mental boundaries give us the freedom to have our own thoughts and opinions -- Emotional boundaries help us to deal with our own emotions and disengage from the harmful, manipulative emotions of others -- Spiritual boundaries help us to distinguish God's will from our own and give us renewed awe for our Creator -- Often, Christians focus so much on being loving and unselfish that they forget their own limits and limitations. When confronted with their lack of boundaries, they ask: - Can I set limits and still be a loving person? - What are legitimate boundaries? - What if someone is upset or hurt by my boundaries? - How do I answer someone who wants my time, love, energy, or money? - Aren't boundaries selfish? - Why do I feel guilty or afraid when I consider setting boundaries? Dr. Henry Cloud and Dr. John Townsend offer biblically-based answers to these and other tough questions, showing us how to set healthy boundaries with our parents, spouses, children, friends, co-workers, and even ourselves.\n", "genres": ["Personal Development", "Counselling", "Self Help", "Christianity", "Psychology", "Faith", "Christian Living", "Christian", "Religion", "Nonfiction", "Relationships"]}, "28268515": {"bookid": "28268515", "title": "The Road Back to You: An Enneagram Journey to Self-Discovery", "author": "Ian Morgan Cron", "series": "", "ratings": "43563", "reviews": "3379", "rating": "4.21", "description": "Ignorance is bliss except in self-awareness...What you don't know about yourself can hurt you and your relationships―and even keep you in the shallows with God. Do you want help figuring out who you are and why you're stuck in the same ruts? The Enneagram is an ancient personality typing system with an uncanny accuracy in describing how human beings are wired, both positiv\nIgnorance is bliss except in self-awareness...What you don't know about yourself can hurt you and your relationships―and even keep you in the shallows with God. Do you want help figuring out who you are and why you're stuck in the same ruts? The Enneagram is an ancient personality typing system with an uncanny accuracy in describing how human beings are wired, both positively and negatively. In The Road Back to You Ian Morgan Cron and Suzanne Stabile forge a unique approach―a practical, comprehensive way of accessing Enneagram wisdom and exploring its connections with Christian spirituality for a deeper knowledge of ourselves, compassion for others, and love for God. Witty and filled with stories, this book allows you to peek inside each of the nine Enneagram types, keeping you turning the pages long after you have read the chapter about your own number. Not only will you learn more about yourself, but you will also start to see the world through other people's eyes, understanding how and why people think, feel, and act the way they do. Beginning with changes you can start making today, the wisdom of the Enneagram can help take you further along into who you really are―leading you into places of spiritual discovery you would never have found on your own, and paving the way to the wiser, more compassionate person you want to become.\n", "genres": ["Personal Development", "Leadership", "Self Help", "Spirituality", "Psychology", "Faith", "Audiobook", "Christian", "Religion", "Nonfiction"]}, "46186": {"bookid": "46186", "title": "Parenting With Love and Logic", "author": "Foster W. Cline", "series": "", "ratings": "12606", "reviews": "1441", "rating": "4.06", "description": "This parenting book shows you how to raise self-confident, motivated children who are ready for the real world. Learn how to parent effectively while teaching your children responsibility and growing their character. Establish healthy control through easy-to-implement steps without anger, threats, nagging, or power struggles. Indexed for easy ref", "genres": ["Family", "Self Help", "Education", "Psychology", "Parenting", "Childrens", "Christian", "Adult", "Nonfiction", "Relationships"]}, "106590": {"bookid": "106590", "title": "Lincoln", "author": "David Herbert Donald", "series": "", "ratings": "44290", "reviews": "639", "rating": "4.16", "description": "A masterful work by Pulitzer Prize–winning author David Herbert Donald, Lincoln is a stunning portrait of Abraham Lincoln’s life and presidency.Donald brilliantly depicts Lincoln’s gradual ascent from humble beginnings in rural Kentucky to the ever-expanding political circles in Illinois, and finally to the presidency of a country divided by civil war. Donald goes beyond b\nA masterful work by Pulitzer Prize–winning author David Herbert Donald, Lincoln is a stunning portrait of Abraham Lincoln’s life and presidency.Donald brilliantly depicts Lincoln’s gradual ascent from humble beginnings in rural Kentucky to the ever-expanding political circles in Illinois, and finally to the presidency of a country divided by civil war. Donald goes beyond biography, illuminating the gradual development of Lincoln’s character, chronicling his tremendous capacity for evolution and growth, thus illustrating what made it possible for a man so inexperienced and so unprepared for the presidency to become a great moral leader. In the most troubled of times, here was a man who led the country out of slavery and preserved a shattered Union—in short, one of the greatest presidents this country has ever seen.\n", "genres": ["Military History", "Civil War", "North American Hi...", "Us Presidents", "Politics", "Presidents", "Biography Memoir", "American History", "Nonfiction", "Biography", "Historical", "History"]}, "6989559": {"bookid": "6989559", "title": "The Right Attitude to Rain", "author": "Alexander McCall Smith", "series": "(Isabel Dalhousie #3)", "ratings": "10058", "reviews": "791", "rating": "3.77", "description": "ISABEL DALHOUSIE - Book 3Nothing captures the charm of Edinburgh like the bestselling Isabel Dalhousie series of novels featuring the insatiably curious philosopher and woman detective.  Whether investigating a case or a problem of philosophy, the indefatigable Isabel Dalhousie, one of fiction’s most richly developed amateur detectives, is always ready to pursue the answer\nISABEL DALHOUSIE - Book 3Nothing captures the charm of Edinburgh like the bestselling Isabel Dalhousie series of novels featuring the insatiably curious philosopher and woman detective.  Whether investigating a case or a problem of philosophy, the indefatigable Isabel Dalhousie, one of fiction’s most richly developed amateur detectives, is always ready to pursue the answers to all of life’s questions, large and small.The delectable new installment in the bestselling and already beloved adventures of Isabel Dalhousie and her no-nonsense housekeeper, Grace.When friends from Dallas arrive in Edinburgh and introduce Isabel to Tom Bruce – a bigwig at home in Texas – several confounding situations unfurl at once. Tom’s young fiancée’s roving eye leads Isabel to believe that money may be the root of her love for Tom. But what, Isabel wonders, is the root of the interest Tom begins to show for Isabel herself? And she can’t forget about her niece, Cat, who’s busy falling for a man whom Isabel suspects of being an incorrigible mama’s boy. Of course Grace and Isabel’s friend Jamie counsel Isabel to stay out of all of it, but there are irresistible philosophical issues at stake – when to tell the truth and when to keep one’s mouth shut, to be precise – and philosophical issues are meat and drink to Isabel Dalhousie, editor of the Review of Applied Ethics. In any case, she’s certain of the ethical basis for a little sleuthing now and again – especially when the problems involve matters of the heart.From the Trade Paperback edition.\n", "genres": ["Novels", "Mystery", "Cultural", "Scotland", "British Literature", "Audiobook", "Fiction", "Contemporary", "Adult Fiction", "European Literature", "Philosophy", "Romance"]}, "793590": {"bookid": "793590", "title": "Why Mosquitos Buzz in People's Ears", "author": "Verna Aardema", "series": "", "ratings": "25788", "reviews": "1426", "rating": "4.04", "description": "In this Caldecott Medal winner, Mosquito tells a story that causes a jungle disaster. \"Elegance has become the Dillons' hallmark. . . . Matching the art is Aardema's uniquely onomatopoeic text . . . An impressive showpiece.\"--Booklist, starred review. Full color.\nIn this Caldecott Medal winner, Mosquito tells a story that causes a jungle disaster. \"Elegance has become the Dillons' hallmark. . . . Matching the art is Aardema's uniquely onomatopoeic text . . . An impressive showpiece.\"--Booklist, starred review. Full color.\n", "genres": ["Cultural", "Folklore", "Folk Tales", "Fantasy", "Animals", "Childrens", "Fiction", "Picture Books", "Africa", "Classics"]}, "13183957": {"bookid": "13183957", "title": "Shadows", "author": "Jennifer L. Armentrout", "series": "(Lux #0.5)", "ratings": "39599", "reviews": "3134", "rating": "4.11", "description": "The last thing Dawson Black expected was Bethany Williams. As a Luxen, an alien life form on Earth, human girls are…well, fun. But since the Luxen have to keep their true identities a secret, falling for one would be insane.Dangerous. Tempting. Undeniable.Bethany can’t deny the immediate connection between her and Dawson. And even though boys aren’t a complication she want\nThe last thing Dawson Black expected was Bethany Williams. As a Luxen, an alien life form on Earth, human girls are…well, fun. But since the Luxen have to keep their true identities a secret, falling for one would be insane.Dangerous. Tempting. Undeniable.Bethany can’t deny the immediate connection between her and Dawson. And even though boys aren’t a complication she wants, she can’t stay away from him. Still, whenever they lock eyes, she’s drawn in.Captivated. Lured. Loved.Dawson is keeping a secret that will change her existence...and put her life in jeopardy. But even he can’t stop risking everything for one human girl. Or from a fate that is as unavoidable as love itself.\n", "genres": ["Urban Fantasy", "Paranormal Romance", "Young Adult", "Aliens", "Novella", "Fantasy", "Supernatural", "Paranormal", "Science Fiction", "Romance"]}, "1153362": {"bookid": "1153362", "title": "The Dog Who Had Kittens", "author": "Polly Robertus", "series": "", "ratings": "188", "reviews": "38", "rating": "4.10", "description": "A basset hound is miserable until he adopts some kittens. Baxter the Basset Hound comes to the aid of some kittens when their mother disappears one afternoon. Winner Of: Colorado Children's Book Award Young Hoosier Picture Book Award Nevada Young Readers Award Washington Children's Choice Picture Book Award\nA basset hound is miserable until he adopts some kittens. Baxter the Basset Hound comes to the aid of some kittens when their mother disappears one afternoon. Winner Of: Colorado Children's Book Award Young Hoosier Picture Book Award Nevada Young Readers Award Washington Children's Choice Picture Book Award\n", "genres": ["Storytime", "Cats", "Animals", "Childrens", "Dogs", "Fiction", "Picture Books"]}, "79626": {"bookid": "79626", "title": "D'Aulaires' Book of Greek Myths", "author": "Ingri d'Aulaire", "series": "(D'Aulaires' Greek Myths)", "ratings": "17714", "reviews": "1134", "rating": "4.41", "description": "Here are the gods, goddesses, and legendary figures of ancient Greece--mighty Zeus, with his fistful of thunderbolts; gray-eyed Athena, goddess of wisdom; Helios, the sun; greedy King Midas--lavishly depicted by Caldecott winners Ingri and Edgar Parin d'Aulaire. In a relaxed and humorous tone, these splendid artists bring to life the myths that have inspired great European\nHere are the gods, goddesses, and legendary figures of ancient Greece--mighty Zeus, with his fistful of thunderbolts; gray-eyed Athena, goddess of wisdom; Helios, the sun; greedy King Midas--lavishly depicted by Caldecott winners Ingri and Edgar Parin d'Aulaire. In a relaxed and humorous tone, these splendid artists bring to life the myths that have inspired great European literature and art through the ages, creating a book readers of all ages will cherish.\"For any child fortunate enough to have this generous book...the kings and heroes of ancient legend will remain forever matter-of-fact; the pictures interpret the text literally and are full of detail and witty observation.\"--The Horn  Book\"The drawings, particularly the full-page ones in this oversized volume, are excellent  and excitingly evocative.\"--The New  York Times\"Parents, uncles, and aunts who have been searching for a big picture book that has good reading-aloud value for the younger ones and fine read-it-yourself value on up, have it in this volume...a children's classic.\"--Christian Science Monitor\n", "genres": ["Cultural", "Greek Mythology", "Young Adult", "Mythology", "Greece", "Fantasy", "Childrens", "Fiction", "Picture Books", "Religion", "Classics"]}, "13117308": {"bookid": "13117308", "title": "Black List", "author": "Brad Thor", "series": "(Scot Harvath #11)", "ratings": "19036", "reviews": "956", "rating": "4.23", "description": "Somewhere deep inside the United States government is a closely guarded list. Members of Congress never get to see it—only the President and a secret team of advisers. Once your name is on the list, it doesn’t come off . . . until you’re dead.Someone has just added counterterrorism operative Scot Harvath’s name.Somehow Harvath must evade the teams dispatched to kill him lo\nSomewhere deep inside the United States government is a closely guarded list. Members of Congress never get to see it—only the President and a secret team of advisers. Once your name is on the list, it doesn’t come off . . . until you’re dead.Someone has just added counterterrorism operative Scot Harvath’s name.Somehow Harvath must evade the teams dispatched to kill him long enough to untangle who has targeted him and why they want him out of the way.Somewhere, someone, somehow can put all the pieces together. The only question is, will Harvath get to that person before the United States suffers the most withering terrorist attack ever conceived?\n", "genres": ["Spy Thriller", "Mystery", "Suspense", "Espionage", "Audiobook", "Fiction", "Thriller", "Action", "Mystery Thriller", "Adventure"]}, "11174785": {"bookid": "11174785", "title": "Powers of Influence", "author": "Arey, Jordan", "series": "", "ratings": "16", "reviews": "6", "rating": "4.38", "description": "Great book club book! A great read, really makes you", "genres": []}, "289601": {"bookid": "289601", "title": "A Certain Slant of Light", "author": "Laura Whitcomb", "series": "(Light #1)", "ratings": "19017", "reviews": "1928", "rating": "3.83", "description": "In the class of the high school English teacher she has been haunting, Helen feels them: for the first time in 130 years, human eyes are looking at her. They belong to a boy, a boy who has not seemed remarkable until now. And Helen--terrified, but intrigued--is drawn to him. The fact that he is in a body and she is not presents this unlikely couple with their first challen\nIn the class of the high school English teacher she has been haunting, Helen feels them: for the first time in 130 years, human eyes are looking at her. They belong to a boy, a boy who has not seemed remarkable until now. And Helen--terrified, but intrigued--is drawn to him. The fact that he is in a body and she is not presents this unlikely couple with their first challenge. But as the lovers struggle to find a way to be together, they begin to discover the secrets of their former lives and of the young people they come to possess.\n", "genres": ["Paranormal Romance", "Young Adult", "Horror", "Ghosts", "Fantasy", "Fiction", "Supernatural", "Teen", "Paranormal", "Romance"]}, "232937": {"bookid": "232937", "title": "The Time of the Doves", "author": "Mercè Rodoreda", "series": "", "ratings": "7342", "reviews": "616", "rating": "3.86", "description": "Barcelona, early 1930s: Natalia, a pretty shop-girl from the working-class quarter of Gracia, is hesitant when a stranger asks her to dance at the fiesta in Diamond Square. But Joe is charming and forceful, and she takes his hand. They marry and soon have two children; for Natalia it is an awakening, both good and bad. When Joe decides to breed pigeons, the birds delight h\nBarcelona, early 1930s: Natalia, a pretty shop-girl from the working-class quarter of Gracia, is hesitant when a stranger asks her to dance at the fiesta in Diamond Square. But Joe is charming and forceful, and she takes his hand. They marry and soon have two children; for Natalia it is an awakening, both good and bad. When Joe decides to breed pigeons, the birds delight his son and daughter - and infuriate his wife. Then the Spanish Civil War erupts, and lays waste to the city and to their simple existence. Natalia remains in Barcelona, struggling to feed her family, while Joe goes to fight the fascists, and one by one his beloved birds fly away. A highly acclaimed classic that has been translated into more than twenty languages, In Diamond Square is the moving, vivid and powerful story of a woman caught up in a convulsive period of history.\n", "genres": ["Novels", "Cultural", "Historical Fiction", "Literature", "Spain", "Fiction", "Literary Fiction", "European Literature", "War", "Spanish Literature", "Classics", "20th Century", "Historical"]}, "17989576": {"bookid": "17989576", "title": "Parenting Your Child Leader: Strategies for Helping Your Child Achieve Their Leadership Potential", "author": "Darryl Bodkin", "series": "", "ratings": "4", "reviews": "2", "rating": "4.50", "description": "p>Darryl Bodkin has written a wonderful treatise on child development and leadership. He writes from a child's perspective on parenting and provides invaluable insight on the subject of leadership growth and development. When I was 11 years of age, my life was torn apart by the loss of my father in a tragic construction accident. It was a defining moment for me. Fortunatel\np>Darryl Bodkin has written a wonderful treatise on child development and leadership. He writes from a child's perspective on parenting and provides invaluable insight on the subject of leadership growth and development. When I was 11 years of age, my life was torn apart by the loss of my father in a tragic construction accident. It was a defining moment for me. Fortunately, my godly grandmother sat down with me and told me that I had to be the leader in our home since I was the oldest child. From that moment leadership was thrust upon me. Reading this book has caused me to reflect on that landmark day in my own childhood when I started on a leadership journey. I commend Darryl Bodkin's book to you for your enjoyment and personal growth. I believe every parent who reads it will benefit from the lessons taught on parenting and will gain an understanding of how to encourage the development of leadership qualities in children. Proverbs 3:5-6 is a sterling reminder of the potential for vital Christian leadership within every child that is born into God's big world. Dr. Stan A. Toler Bestselling Author Oklahoma City, Oklahoma\n", "genres": ["Parenting"]}, "6096829": {"bookid": "6096829", "title": "Essex County", "author": "Jeff Lemire", "series": "(Essex County #1-3)", "ratings": "10708", "reviews": "1100", "rating": "4.32", "description": "Where does a young boy turn when his whole world suddenly disappears? What turns two brothers from an unstoppable team into a pair of bitterly estranged loners? How does the simple-hearted care of one middle-aged nurse reveal the scars of an entire community, and can anything heal the wounds caused by a century of deception?Award-winning cartoonist Jeff Lemire pays tribute\nWhere does a young boy turn when his whole world suddenly disappears? What turns two brothers from an unstoppable team into a pair of bitterly estranged loners? How does the simple-hearted care of one middle-aged nurse reveal the scars of an entire community, and can anything heal the wounds caused by a century of deception?Award-winning cartoonist Jeff Lemire pays tribute to his roots with Essex County, an award-winning trilogy of graphic novels set in an imaginary version of his hometown, the eccentric farming community of Essex County, Ontario, Canada. In Essex County, Lemire crafts an intimate study of one community through the years, and a tender meditation on family, memory, grief, secrets, and reconciliation. With the lush, expressive inking of a young artist at the height of his powers, Lemire draws us in and sets us free. This new edition collects the complete, critically-acclaimed trilogy (Tales from the Farm, Ghost Stories, and The Country Nurse) in one deluxe volume! Also included are over 40-pages of previously unpublished material, including two new stories.\n", "genres": ["Graphic Novels", "Cultural", "Canada", "Graphic Novels Comics", "Young Adult", "Family", "Comic Book", "Comics", "Sequential Art", "Fiction", "Contemporary", "Comix"]}, "16079018": {"bookid": "16079018", "title": "Het werk", "author": "Etty Hillesum", "series": "", "ratings": "2961", "reviews": "373", "rating": "4.31", "description": "De dagboeken en brieven van de joodse Etty Hillesum werden aanvankelijk geschreven midden in bezet Amsterdam. Zittend voor het raam van haar kamer aan het Museumplein schreef zij een indrukwekkend, bezield en universeel werk. Met haar intelligente en sensitieve geest ontworstelde zij zich aan de machten die uit waren op de ondergang van haar en haar joodse medemensen. Zij \nDe dagboeken en brieven van de joodse Etty Hillesum werden aanvankelijk geschreven midden in bezet Amsterdam. Zittend voor het raam van haar kamer aan het Museumplein schreef zij een indrukwekkend, bezield en universeel werk. Met haar intelligente en sensitieve geest ontworstelde zij zich aan de machten die uit waren op de ondergang van haar en haar joodse medemensen. Zij wist zich in haar schrijven als het ware te verheffen boven de terreur die zich overal om haar heen voltrok. Wanneer Etty ten slotte in kamp Westerbork terechtkomt, waar ze wordt geconfronteerd met het ontzaglijke leed van de transporten die elke week naar het oosten vertrekken, weet zij nog eens te meer gestalte te geven aan haar radicale ethiek en bewogenheid met anderen. Haar aantekeningen en brieven uit deze periode getuigen van een sterke persoonlijke ontwikkeling en een subliem literair talent.Deze nieuwe monumentale uitgave van al haar werk is verbeterd, aangevuld en vermeerderd met een aantal nieuw gevonden documenten en staat onder redactie van K.A.D. Smelik, die leiding geeft van het Etty Hillesum Onderzoekscentrum. Het werk is een must voor iedereen die ooit Het verstoorde leven las, dat in 1981 verscheen en sindsdien over de hele wereld is vertaald en gelezen.\n", "genres": ["Autobiography", "Memoir", "Philosophy", "Diary", "Nonfiction", "Biography Memoir", "War", "Holocaust", "World War II", "Biography", "History"]}, "22440552": {"bookid": "22440552", "title": "Are We Normal? Funny True Stories from an Everyday Family", "author": "Christina Scalise", "series": "", "ratings": "20", "reviews": "9", "rating": "4.20", "description": "Do all moms really have X-ray vision and eyes in the back of their heads? Author Christina Scalise’s kids think so. And the New York author isn’t above using her maternal superpowers to deal with the challenges of childrearing. How else could she accomplish such seemingly impossible feats as getting three kids to try brussels sprouts for the first time? Scalise may not act\nDo all moms really have X-ray vision and eyes in the back of their heads? Author Christina Scalise’s kids think so. And the New York author isn’t above using her maternal superpowers to deal with the challenges of childrearing. How else could she accomplish such seemingly impossible feats as getting three kids to try brussels sprouts for the first time? Scalise may not actually be more powerful than a locomotive, but she’s able to get her family to hang the toilet paper in the “over” position—most of the time, anyway. And she may not be able to leap tall buildings in a single bound, but if her kids accidentally leave their dirty clothes on the floor, they know their wayward apparel could likely end up dangling from the nearby treetops, faster than a speeding bullet. “Life is way too short,” says Scalise, “so try to enjoy every minute of it with a sense of humor! With that kind of outlook on life’s crazy moments, Scalise and her family have often been left asking themselves one recurring question, which became the title of her new book: “Are We Normal?” Scalise shares some key parenting lessons learned the hard way, such as what happens when a when a preschooler finds himself alone with a VCR, a broomstick, and a peanut-butter-and-jelly sandwich. “I originally started writing this book as a journal of stories for my kids to read when they were older and had children of their own—a few funny stories they could tell our future grandchildren about,” she says. “Then it grew from there, with one story after another. After a while I figured, ‘Why not share our stories with the rest of the world? I’m sure most people can relate to at least one or more of these stories. And if not—well, I hope readers at least get a good laugh out of them.’”\n", "genres": ["Parenting"]}, "22748948": {"bookid": "22748948", "title": "Railonama", "author": "Anupama Sharma", "series": "", "ratings": "84", "reviews": "33", "rating": "4.20", "description": "Interested in funny, heart-warming, and inspiring real life travel stories? You will love reading Railonama. Railonama is a compilation of short stories and poems inspired by travel via the Indian Railways. The book features enriching and highly entertaining stories selected from a pool of submissions from people all around the world who have traveled in trains in India. T\nInterested in funny, heart-warming, and inspiring real life travel stories? You will love reading Railonama. Railonama is a compilation of short stories and poems inspired by travel via the Indian Railways. The book features enriching and highly entertaining stories selected from a pool of submissions from people all around the world who have traveled in trains in India. This book will make for an engaging and riveting read for those who enjoy traveling and exploring.The book contains stories from authors: Ajay Mankotia, Ambika Jindal, Anindita Deo, Anupama Sharma, Asiem Sanyal, Atul Sharma, Bala Parthasarathy, Chandrashekhr B. Kulkarni, Diane Caldwell, Dilshad Sanyal, Dr K.C. Jindal, Dr Roshan Radhakrishnan, Elayne Clift, Francois Juneau, Frank Joussen, Ganesh V, K.H.D. Karr, Ken Haigh, Kshitij Bisen, Lalita Bhatia, Malini Mathi Vathanan, Mary McCormack, Michael Clifton, Monali Ghatge, Nikhil Narayanan, Pat Hale, Pradeep Chaswal, Raminder Rayar, Renuka Vishwanathan, Rohit Khanduri, Savita Mudgal, Shailender Arya, Sharada Balasubramanian, Sheela Jaywant, Sheila Kumar, Sijeesh V Balakrishnan, Snigdha Khurana, Sukanya Mohan, Sumedha Sengupta, Susmita Bhattacharya, Tessy Koshy, Varsha Halabe,Vibha Batra, Yogesh B Sharma.\n", "genres": ["Cultural", "Indian Literature", "Asian Literature", "Travel", "Trains", "India", "Short Stories", "Railways", "Nonfiction", "Humor"]}, "23569954": {"bookid": "23569954", "title": "Conspiracy", "author": "O.L. Ramos", "series": "(The Keeper #6)", "ratings": "25", "reviews": "9", "rating": "4.60", "description": "The members of the Ironskin Clan live in a state of constant flux. Their lives have been going from blissful and ideal to hellish and miserable since the beginning of the line. With the latest members however, Liz, Michael and Vincent, they have had more than their fair share of the bad. One member of their family has miraculously been restored to them, although a piece of\nThe members of the Ironskin Clan live in a state of constant flux. Their lives have been going from blissful and ideal to hellish and miserable since the beginning of the line. With the latest members however, Liz, Michael and Vincent, they have had more than their fair share of the bad. One member of their family has miraculously been restored to them, although a piece of him is still missing. The Angels have fallen, it's a time of great tragedy for the entire world. But that has not slowed down the plot of the Archdemons, the pagan gods or other, unforeseen enemies... not by one bit. The entire world witnessed the sky literally fall, yet the only evidence left are over a thousand craters littering the worldwide landscape. This has forced many secret societies to form to combat what they perceive as a hidden war, a threat to their ways of life. Without even knowing it, Michael, Liz, Vincent and their entire family, are now being targeted as the sole threat of a massive conspiracy. The humans are no longer finding it easy to accept \"The Great Lie\", the \"Magnum Mendacium\". With time running out, for all factions involved, who will win? Will Clan Ironskin be able to prevent any of their major enemies to triumph, all the while, maintaining the sanctity of the veil? Or is the veil already destroyed, and it's just a matter of time before the humans revolt against the elder races...? Not if nature's staunchest defender has anything to say about that...\n", "genres": []}, "23545844": {"bookid": "23545844", "title": "The Widow or Widower Next Door: 25 Widows & Widowers Answer 25 Questions about Losing a Mate", "author": "MaryLee Robinson", "series": "", "ratings": "34", "reviews": "9", "rating": "3.94", "description": "Most everyone knows that losing a mate to death is a painful experience. Those who have not had such a loss of someone very close, seldom realize the depth and breadth of that pain. As a result, in an effort to make the bereaved (or themselves) feel better, and to distance themselves from the event they say and do some outrageous and unthinking things. Others, possessing v\nMost everyone knows that losing a mate to death is a painful experience. Those who have not had such a loss of someone very close, seldom realize the depth and breadth of that pain. As a result, in an effort to make the bereaved (or themselves) feel better, and to distance themselves from the event they say and do some outrageous and unthinking things. Others, possessing very tender hearts, say and do some of the kindest things imagineable. Most all of us who participated in writing this book found ourselves surprised by other people's reactions to our loss.  The Widow or Widower Next Door is a collection of stories that reveal the unexpected reactions that occur. We prepare for school by attending Pre-K. We prepare to get our Driver's License by taking driving lessons. We got to pre-marital counseling before we wed. Nothing, but nothing prepares us for the loss of a spouse. We hope this book will get people thinking and preparing, and we hope that it will help them learn how to better help a friend or a neighbor with such a loss.  Readers have asked why is there a logo of a hand with a heart in it as the cover of the book? The answer lies in The Valentine's Story, excerpted from the book: \"The doctors told me that Pat was not going to be with me much longer. I took a red marker and a ballpoint pen with me to the hospital on Valentine's Day. I took his hand and drew a heart on his palm. I wrote \"my heart\" inside it and said 'I love you; you hold my heart in your hand'. The mortician left it in place. Pat still holds my heart in his hand and my heart is warm because of it.\n", "genres": []}, "23154550": {"bookid": "23154550", "title": "Sweet Mungo", "author": "Meriel Brooke", "series": "", "ratings": "34", "reviews": "29", "rating": "4.26", "description": "Sweet Mungo...'Mungo', An unusual name for an unusual boy. Growing up in England, at a time when homosexuality was illegal and rarely discussed. Mungo's looks are so arresting that sometimes his beauty spells danger. Abused by his father; seduced by a teacher; sodomised by a gang of roughs... Not the best upbringing. But there is hope, close friends like Amy and Tom who ar\nSweet Mungo...'Mungo', An unusual name for an unusual boy. Growing up in England, at a time when homosexuality was illegal and rarely discussed. Mungo's looks are so arresting that sometimes his beauty spells danger. Abused by his father; seduced by a teacher; sodomised by a gang of roughs... Not the best upbringing. But there is hope, close friends like Amy and Tom who are willing to be there for him. Hilary, who starts as an enemy and then becomes a friend and who is maybe destined to be something much more...Mungo loves music and singing in a choir. He eventually decides to join the theatre, becoming an accomplished actor. But his sexuality remains confused, even the prospect of marriage and parenthood offers him no solace. Will he find himself or is he destined to live a life of lies?The story of Mungo is perhaps the story of every young child who ever grew up with troubles and nightmares. Or perhaps it’s the story of every young adolescent who ever questioned their sexuality. Or perhaps it’s the story of every man and woman who has ever questioned whether they will find success, their place in the world, and most importantly of all... contentment.To read Sweet Mungo is to be transported to a world of both harshness and hope, a world of pain and pleasure, and most importantly, a world that allows you to get to know and to care for Sweet Mungo.\n", "genres": []}, "25712105": {"bookid": "25712105", "title": "The Creator of the Universe: A Scientific Approach to Christian Faith", "author": "Corrado Ghinamo", "series": "", "ratings": "2", "reviews": "0", "rating": "4.00", "description": "Are science and faith antithetic? Are the new discoveries in science making faith in God totter? Or can science be the basis for strong faith and the belief in a Creator? Discover how. The Creator of the Universe is the author's original manuscript that gave birth to the book \"The Beautiful Scientist.\" This amazing book takes an interesting look at science and faith, and h\nAre science and faith antithetic? Are the new discoveries in science making faith in God totter? Or can science be the basis for strong faith and the belief in a Creator? Discover how. The Creator of the Universe is the author's original manuscript that gave birth to the book \"The Beautiful Scientist.\" This amazing book takes an interesting look at science and faith, and how the two can work together to prove there is a Creator. Corrado Ghinamo believes it is the very existence of the universe that allows people to see there is a super-entity, there is a God. He uses scientific evidence, like the Big Bang Theory, the smallest particles of the universe, the galaxies, and what he calls the Super-Force to prove just that: God does exist. Creation and evolution are not two separate ideals; rather evolution is one of the means that God used and still uses in creating and governing the universe. Ghinamo shows that God is a logical necessity to complete the vision of scientist's universe. The same goes for people of faith; there is scientific evidence that can further the existence of a Creator. The Creator of the Universe: A Scientific Approach to Christian Faith uses easy-to-understand language, examples from everyday life, and an easy-to-follow structure to prove that the universe, far more beautiful and complex than people can imagine, was in fact created by God, and that evidence and rationality in science can lead to the belief in God.\n", "genres": []}, "25537520": {"bookid": "25537520", "title": "My Dragonfly: And the Lessons He Taught Me", "author": "Kathy Zengolewicz", "series": "", "ratings": "4", "reviews": "0", "rating": "4.00", "description": "My Dragonfly represents the son that Kathy Lost to drug addiction in September of 2012. My Dragonfly was written to help those who have lost a child or children,to let them know that their life matters and to help them find the healing they need to feel whole again. It is Kathy's passionate hope that this book can shed some light on the ways you can conquer grief, kick it \nMy Dragonfly represents the son that Kathy Lost to drug addiction in September of 2012. My Dragonfly was written to help those who have lost a child or children,to let them know that their life matters and to help them find the healing they need to feel whole again. It is Kathy's passionate hope that this book can shed some light on the ways you can conquer grief, kick it to the cur and create a new life filled with love, peace and joy\n", "genres": []}, "25410674": {"bookid": "25410674", "title": "Prince Charming Opens Doors, the Buffoon Opens Legs: The Seduction Manual that Women Don't Want You to Read", "author": "Lucano Divina", "series": "", "ratings": "45", "reviews": "5", "rating": "3.84", "description": "Prince Charming Opens Doors, the Buffoon Opens Legs is the medicine that your organism is demanding. For a long time you have tried to seduce women using flowers, chocolates, and clichéd pick-up lines with the hope of opening legs, but instead you’ve had to settle for opening the doors of restaurants, cars, and elevators. You’re a Prince Charming, and that is your problem,\nPrince Charming Opens Doors, the Buffoon Opens Legs is the medicine that your organism is demanding. For a long time you have tried to seduce women using flowers, chocolates, and clichéd pick-up lines with the hope of opening legs, but instead you’ve had to settle for opening the doors of restaurants, cars, and elevators. You’re a Prince Charming, and that is your problem, your karma, and your disease. But be calm. Don’t worry. There is now a cure: you have to transform into a Buffoon, by following the advice of a Bengal tiger. A Buffoon? Yes—the one who has his eyes wide open to the mating realities that Prince Charming refuses to see. He doesn’t look for love where there is only friendship. He realizes that paying for sex is cheaper than getting it free. He knows the hidden messages that his shoes send. He can distinguish the strategies used by women to win an argument without being right. He overcomes the feminine obsession with wanting to change men. He is an expert in one-night stands. He is confident that no Female human is out of his league. He is a Buffoon. A Bengal tiger? Yes—Lucano Divina, who leads the Animal Revolution. He escaped from the Acheron Zoo to fight against the imperialism of human stupidity, and is being hunted by humans to be turned into a rug, due to the inconvenient truths he reveals. He writes a very popular and very reviled blog from the jungles of Latin America. He is considered the sexiest living being on the face of the Earth. He will make you a Buffoon. Have you ever wondered what some guys did to become a woman magnet almost effortlessly? Now you know: you were in the company of Buffoons. Today you too can become one, if you accept the treatment that Lucano Divina offers you in this book. It won’t be easy: your organism will resist detoxification from your seduction preconceptions. You will be afraid to unlearn so you can learn, but in the end you will understand—you will understand women. That will be your advantage against your rivals. Never again will you say, “Nobody understands them,” because you will; and that will allow you to open countless legs.\n", "genres": ["Sexuality", "Relationships"]}, "24932626": {"bookid": "24932626", "title": "Annie and the Senator (Annie Chan Thrillers #1)", "author": "Robert W. McGee", "series": "", "ratings": "16", "reviews": "1", "rating": "4.00", "description": "Annie Chan. Half Chinese, half Thai. Daughter of a Bangkok pole dancer. Her beauty and other talents catapulted her into the world of high-priced Hong Kong escorts. Her life changed when her millionaire lover sent her to America to get an education. A few years later she emerged from Harvard with an MBA and CPA. With a little help from her friend she rose to the position o\nAnnie Chan. Half Chinese, half Thai. Daughter of a Bangkok pole dancer. Her beauty and other talents catapulted her into the world of high-priced Hong Kong escorts. Her life changed when her millionaire lover sent her to America to get an education. A few years later she emerged from Harvard with an MBA and CPA. With a little help from her friend she rose to the position of president at one of the largest banks in Miami. Her career was going along well until a certain senator started causing problems for her. When he threatened to expose her past and destroy her career, she decided she had to silence him. The problem is, she didn’t know how to do it. Not right away, that is.\n", "genres": []}, "32620489": {"bookid": "32620489", "title": "Designer Mindset: Change your mind, Change your life", "author": "Gina Carré", "series": "", "ratings": "2", "reviews": "1", "rating": "5.00", "description": "Embrace change, re-design your mindset & create a life you truly desire!  What motivates us? Why do we allow fear to hold us back? How do we empower ourselves to change?  In this inspiring self-awareness guide, Gina shares the secrets behind the concept of re-designing your mindset. She explains how she went from homeless, in debt, addicted to drugs, and suffering PTSD and\nEmbrace change, re-design your mindset & create a life you truly desire!  What motivates us? Why do we allow fear to hold us back? How do we empower ourselves to change?  In this inspiring self-awareness guide, Gina shares the secrets behind the concept of re-designing your mindset. She explains how she went from homeless, in debt, addicted to drugs, and suffering PTSD and depression, to founding her own company and working alongside the world's top motivation speakers.  In this book, you'll learn how to:  Stop self-sabotaging behaviors, negative thinking & addictive attitudes Tap into unlimited confidence Master your emotions & mindset Attract abundance & fulfilling relationships Embrace change & create a life you truly desire!  If you are ready for change then this is the book for you!\n", "genres": []}, "33126334": {"bookid": "33126334", "title": "Psychology: Simply Explained Psychology Techniques To Influence And Control People Using Mentalism, Hypnosis", "author": "Hezi Medina", "series": "", "ratings": "17", "reviews": "4", "rating": "3.76", "description": "Influence Others and Make Your World a Better Place!\n\nClick the Read More button and discover the key to changing people’s minds.\nDo you want to feel:   Free to Make Your Own Decisions?   In Control of Your Life?   Popular and Prestigious?   Capable of Influencing Others?   and Successful in Social Settings?   If so, you simply must read Hezi Medina’s Psychology\n\nInfluence Others and Make Your World a Better Place!\n\nClick the Read More button and discover the key to changing people’s minds.\nDo you want to feel:   Free to Make Your Own Decisions?   In Control of Your Life?   Popular and Prestigious?   Capable of Influencing Others?   and Successful in Social Settings?   If so, you simply must read Hezi Medina’s Psychology: Simply Explained Psychology Techniques to Influence and Control People Using Mentalism, Hypnosis! This exciting guidebook contains powerful psychological techniques for observing and understanding others. With this knowledge and insight, you can understand the effect people have on you – and influence their thoughts and actions. Inside Psychology, you’ll discover a vast array of potent techniques and concepts. You can:    Discover Who You are with the Power of Identity Psychology   Learn How Your Biology and Environment Influence Your “Free Will”   Unlock the Secrets of Information Processing, Judgement, Decision-Making   Use the Powers of Mentalism to Empower—and Overpower—Others   Know When People Are Lying   Convince Others to See Your Point of View   \nand much more!\n Inside this book, you’ll find fascinating mentalism tricks, including the Rainbow Ruse, the Precognition Trick, and the Brainwave Technique. You’ll learn the subtle arts of Hypnosis and Mesmerism – and how help others achieve their goals through hypnotherapy. This book includes 18 insightful hypnotherapy methods like Progressive Muscle Relaxation, the Anchoring Technique, and the Jacques Statement. You’ll also discover 20 NLP (Neuro Linguistic Programming) Techniques and 20 Tactics of Professional Illusionists! \nDon’t waste another day letting others control your mind, emotions, and actions. Order your copy of Psychology and take charge of your life TODAY!\nIt’s easy – just scroll up the right-hand side of the screen and click the BUY NOW WITH ONE CLICK button! \n", "genres": []}}