{"33555224": {"bookid": "33555224", "title": "Thunderhead", "author": "Neal Shusterman", "series": "(Arc of a Scythe #2)", "ratings": "116546", "reviews": "17054", "rating": "4.43", "description": "Rowan has gone rogue, and has taken it upon himself to put the Scythedom through a trial by fire. Literally. In the year since Winter Conclave, he has gone off-grid, and has been striking out against corrupt scythes—not only in MidMerica, but across the entire continent. He is a dark folk hero now—“Scythe Lucifer”—a vigilante taking down corrupt scythes in flames.Citra, no\nRowan has gone rogue, and has taken it upon himself to put the Scythedom through a trial by fire. Literally. In the year since Winter Conclave, he has gone off-grid, and has been striking out against corrupt scythes—not only in MidMerica, but across the entire continent. He is a dark folk hero now—“Scythe Lucifer”—a vigilante taking down corrupt scythes in flames.Citra, now a junior scythe under Scythe Curie, sees the corruption and wants to help change it from the inside out, but is thwarted at every turn, and threatened by the “new order” scythes. Realizing she cannot do this alone—or even with the help of Scythe Curie and Faraday, she does the unthinkable, and risks being “deadish” so she can communicate with the Thunderhead—the only being on earth wise enough to solve the dire problems of a perfect world. But will it help solve those problems, or simply watch as perfection goes into decline?\n", "genres": ["Science Fiction", "Fiction", "Dystopia", "Fantasy", "Adventure", "Young Adult Fantasy", "Young Adult", "Audiobook", "Teen", "Romance"]}, "1412138": {"bookid": "1412138", "title": "Iron Kissed", "author": "Patricia Briggs", "series": "(Mercy Thompson #3)", "ratings": "117593", "reviews": "4183", "rating": "4.34", "description": "I could smell her fear, and it satisfied something deep inside me that had been writhing under her cool, superior gaze. I curled my upper lip so she could get a good look at my sharp teeth. I might only weigh thirty or so pounds in my coyote shape, but I was a predator...Mechanic Mercy Thompson can shift her shape - but not her loyalty. When her former boss and mentor is a\nI could smell her fear, and it satisfied something deep inside me that had been writhing under her cool, superior gaze. I curled my upper lip so she could get a good look at my sharp teeth. I might only weigh thirty or so pounds in my coyote shape, but I was a predator...Mechanic Mercy Thompson can shift her shape - but not her loyalty. When her former boss and mentor is arrested for murder and left to rot behind bars by his own kind, it's up to Mercy to clear his name, whether he wants her to or not.Mercy's loyalty is under pressure from other directions, too. Werewolves are not known for their patience, and if Mercy can't decide between the two she cares for, Sam and Adam may make the choice for her...\n", "genres": ["Vampires", "Fiction", "Fantasy", "Paranormal", "Fae", "Werewolves", "Fairies", "Paranormal Romance", "Urban Fantasy", "Romance", "Shapeshifters"]}, "12732267": {"bookid": "12732267", "title": "Crossroads", "author": "J.J. Bonds", "series": "(Crossroads Academy #1)", "ratings": "2170", "reviews": "145", "rating": "3.88", "description": "When Katia enrolled at Crossroads Academy she knew things weren’t exactly going to be easy. The sole heir to the worlds’ most powerful vampire, her presence was bound to cause a stir. But nothing could have prepared her for this. Whispers follow everywhere she goes. So does trouble.Bodies start turning up in nearby Rutland and Katia is sucked into a twisted web of danger a\nWhen Katia enrolled at Crossroads Academy she knew things weren’t exactly going to be easy. The sole heir to the worlds’ most powerful vampire, her presence was bound to cause a stir. But nothing could have prepared her for this. Whispers follow everywhere she goes. So does trouble.Bodies start turning up in nearby Rutland and Katia is sucked into a twisted web of danger and deceit. Haunted by nightmares she can’t explain and a thirst for blood that is never sated, Katia will do whatever it takes to keep her past buried.Nothing at Crossroads is what it seems and Katia’s secrets may be the darkest of them all.\n", "genres": ["Vampires", "Fantasy", "Paranormal", "Boarding School", "Young Adult", "Paranormal Romance", "Urban Fantasy", "Supernatural", "High School", "School Stories", "Romance"]}, "10772961": {"bookid": "10772961", "title": "The Book of Lost Souls", "author": "Michelle Muto", "series": "(Ivy MacTavish #1)", "ratings": "765", "reviews": "100", "rating": "3.79", "description": "When teen witch Ivy MacTavish changes a lizard into her date for a Halloween dance, everything turns to chaos. And when no one is powerful enough to transform him back except Ivy, it sparks the rumor: Like father, like daughter. Ivy has heard it all before - that her father, who left when she was seven - was involved with the darkest of magic.Making the rumors worse, someo\nWhen teen witch Ivy MacTavish changes a lizard into her date for a Halloween dance, everything turns to chaos. And when no one is powerful enough to transform him back except Ivy, it sparks the rumor: Like father, like daughter. Ivy has heard it all before - that her father, who left when she was seven - was involved with the darkest of magic.Making the rumors worse, someone uses an evil spell book to bring back two of history's most nefarious killers. Ivy's got a simple plan to set things right: find the real dark spell caster, steal the book, and reverse the spell. No problem! But she'll have to deal with something more dangerous than murderous spirits that want her and her friends dead: the school's resident bad boy and hotter-than-brimstone demon, Nick Marcelli. Nick's offering Ivy more than his help with recovering the missing book - he's offering her a way to ditch her scaly reputation as a lizard-lover. Demons are about as hard to handle as black magic, and as Ivy soon discovers, it's going to take more than a lot of luck and a little charm if she wants to survive long enough to clear her status as a dark witch, get a warm-blooded boyfriend, and have her former date back to eating meal worms before the week's end.\n", "genres": ["Fiction", "Fantasy", "Paranormal", "Magic", "Demons", "Young Adult", "Paranormal Romance", "Urban Fantasy", "Romance", "Witches"]}, "5344": {"bookid": "5344", "title": "Hard Times", "author": "Charles Dickens", "series": "", "ratings": "62118", "reviews": "3457", "rating": "3.53", "description": "\"My satire is against those who see figures and averages, and nothing else,\" proclaimed Charles Dickens in explaining the theme of this classic novel. Published in 1854, the story concerns one Thomas Gradgrind, a \"fanatic of the demonstrable fact,\" who raises his children, Tom and Louisa, in a stifling and arid atmosphere of grim practicality.Without a moral compass to gui\n\"My satire is against those who see figures and averages, and nothing else,\" proclaimed Charles Dickens in explaining the theme of this classic novel. Published in 1854, the story concerns one Thomas Gradgrind, a \"fanatic of the demonstrable fact,\" who raises his children, Tom and Louisa, in a stifling and arid atmosphere of grim practicality.Without a moral compass to guide them, the children sink into lives of desperation and despair, played out against the grim background of Coketown, a wretched community shadowed by an industrial behemoth. Louisa falls into a loveless marriage with Josiah Bouderby, a vulgar banker, while the unscrupulous Tom, totally lacking in principle, becomes a thief who frames an innocent man for his crime. Witnessing the degradation and downfall of his children, Gradgrind realizes that his own misguided principles have ruined their lives.Considered Dickens' harshest indictment of mid-19th-century industrial practices and their dehumanizing effects, this novel offers a fascinating tapestry of Victorian life, filled with the richness of detail, brilliant characterization, and passionate social concern that typify the novelist's finest creations.Of Dickens' work, the eminent Victorian critic John Ruskin had this to say: \"He is entirely right in his main drift and purpose in every book he has written; and all of them, but especially Hard Times, should be studied with close and earnest care by persons interested in social questions.\"\n", "genres": ["Fiction", "British Literature", "Literature", "Historical Fiction", "Classic Literature", "Academic", "Victorian", "Classics", "European Literature", "Historical", "Novels", "19th Century", "School"]}}