{"168642": {"bookid": "168642", "title": "In Cold Blood", "author": "Truman Capote", "series": "", "ratings": "589721", "reviews": "19531", "rating": "4.08", "description": "On November 15, 1959, in the small town of Holcomb, Kansas, four members of the Clutter family were savagely murdered by blasts from a shotgun held a few inches from their faces. There was no apparent motive for the crime, and there were almost no clues. As Truman Capote reconstructs the murder and the investigation that led to the capture, trial, and execution of the kill\nOn November 15, 1959, in the small town of Holcomb, Kansas, four members of the Clutter family were savagely murdered by blasts from a shotgun held a few inches from their faces. There was no apparent motive for the crime, and there were almost no clues. As Truman Capote reconstructs the murder and the investigation that led to the capture, trial, and execution of the killers, he generates both mesmerizing suspense and astonishing empathy. At the center of his study are the amoral young killers Perry Smith and Dick Hickcock, who, vividly drawn by Capote, are shown to be reprehensible yet entirely and frighteningly human. In Cold Blood is a seminal work of modern prose, a remarkable synthesis of journalistic skill and powerfully evocative narrative.\n", "genres": ["History", "Classics", "Literature", "Crime", "Audiobook", "True Crime", "Thriller", "American", "Nonfiction", "Mystery"]}, "58345": {"bookid": "58345", "title": "The Awakening", "author": "Kate Chopin", "series": "", "ratings": "185808", "reviews": "8670", "rating": "3.67", "description": "When first published in 1899, The Awakening shocked readers with its honest treatment of female marital infidelity. Audiences accustomed to the pieties of late Victorian romantic fiction were taken aback by Chopin's daring portrayal of a woman trapped in a stifling marriage, who seeks and finds passionate physical love outside the confines of her domestic situation.Aside f\nWhen first published in 1899, The Awakening shocked readers with its honest treatment of female marital infidelity. Audiences accustomed to the pieties of late Victorian romantic fiction were taken aback by Chopin's daring portrayal of a woman trapped in a stifling marriage, who seeks and finds passionate physical love outside the confines of her domestic situation.Aside from its unusually frank treatment of a then-controversial subject, the novel is widely admired today for its literary qualities. Edmund Wilson characterized it as a work \"quite uninhibited and beautifully written, which anticipates D. H. Lawrence in its treatment of infidelity.\" Although the theme of marital infidelity no longer shocks, few novels have plumbed the psychology of a woman involved in an illicit relationship with the perception, artistry, and honesty that Kate Chopin brought to The Awakening.\n", "genres": ["Classics", "High School", "Novels", "Fiction", "Literature", "School", "Academic", "Historical Fiction", "Read For School", "Historical", "Feminism", "American", "Young Adult"]}, "54539": {"bookid": "54539", "title": "Silas Marner", "author": "George Eliot", "series": "", "ratings": "80379", "reviews": "4170", "rating": "3.66", "description": "George Eliot's tale of a solitary miser gradually redeemed by the joy of fatherhood, Silas Marner is edited with an introduction and notes by David Carroll in Penguin Classics.Wrongly accused of theft and exiled from a religious community many years before, the embittered weaver Silas Marner lives alone in Raveloe, living only for work and his precious hoard of money. But \nGeorge Eliot's tale of a solitary miser gradually redeemed by the joy of fatherhood, Silas Marner is edited with an introduction and notes by David Carroll in Penguin Classics.Wrongly accused of theft and exiled from a religious community many years before, the embittered weaver Silas Marner lives alone in Raveloe, living only for work and his precious hoard of money. But when his money is stolen and an orphaned child finds her way into his house, Silas is given the chance to transform his life. His fate, and that of Eppie, the little girl he adopts, is entwined with Godfrey Cass, son of the village Squire, who, like Silas, is trapped by his past. Silas Marner, George Eliot's favourite of her novels, combines humour, rich symbolism and pointed social criticism to create an unsentimental but affectionate portrait of rural life.This text uses the Cabinet edition, revised by George Eliot in 1878. David Carroll's introduction is complemented by the original Penguin Classics edition introduction by Q.D. Leavis.Mary Ann Evans (1819-80) began her literary career as a translator, and later editor, of the Westminster Review. In 1857, she published Scenes of Clerical Life, the first of eight novels she would publish under the name of 'George Eliot', including The Mill on the Floss, Middlemarch, and Daniel Deronda.If you enjoyed Silas Marner, you might like Nathaniel Hawthorne's The Scarlet Letter, also available in Penguin Classics.'I think Silas Marner holds a higher place than any of the author's works. It is more nearly a masterpiece; it has more of that simple, rounded, consummate aspect ... which marks a classical work'Henry James\n", "genres": ["Classics", "Novels", "British Literature", "Fiction", "Literature", "Victorian", "Classic Literature", "Academic", "European Literature", "School", "Historical Fiction", "19th Century", "Historical"]}, "4009": {"bookid": "4009", "title": "Nine Stories", "author": "J.D. Salinger", "series": "", "ratings": "140366", "reviews": "4908", "rating": "4.18", "description": "Nine Stories (1953) is a collection of short stories by American fiction writer J. D. Salinger published in April 1953. It includes two of his most famous short stories, \"A Perfect Day for Bananafish\" and \"For Esmé – with Love and Squalor\". (Nine Stories is the U.S. title; the book is published in many other countries as For Esmé - with Love and Squalor, and Other Stories.\nNine Stories (1953) is a collection of short stories by American fiction writer J. D. Salinger published in April 1953. It includes two of his most famous short stories, \"A Perfect Day for Bananafish\" and \"For Esmé – with Love and Squalor\". (Nine Stories is the U.S. title; the book is published in many other countries as For Esmé - with Love and Squalor, and Other Stories.)The stories are:\"A Perfect Day for Bananafish\"\"Uncle Wiggily in Connecticut\"\"Just Before the War with the Eskimos\"\"The Laughing Man\"\"Down at the Dinghy\"\"For Esmé – with Love and Squalor\"\"Pretty Mouth and Green My Eyes\"\"De Daumier-Smith's Blue Period\"\"Teddy\"\n", "genres": ["Literary Fiction", "Classics", "20th Century", "Novels", "Fiction", "Literature", "Adult Fiction", "The United States Of America", "Short Stories", "American"]}, "337113": {"bookid": "337113", "title": "The Tenant of Wildfell Hall", "author": "Anne Brontë", "series": "", "ratings": "100310", "reviews": "5790", "rating": "3.99", "description": "This is the story of a woman's struggle for independence. Helen \"Graham\" has returned to Wildfell Hall in flight from a disastrous marriage. Exiled to the desolate moorland mansion, she adopts an assumed name and earns her living as a painter.\nThis is the story of a woman's struggle for independence. Helen \"Graham\" has returned to Wildfell Hall in flight from a disastrous marriage. Exiled to the desolate moorland mansion, she adopts an assumed name and earns her living as a painter.\n", "genres": ["Romance", "Classics", "British Literature", "Fiction", "Literature", "Victorian", "Classic Literature", "Gothic", "European Literature", "Historical Fiction", "19th Century", "Historical"]}, "3478": {"bookid": "3478", "title": "Message in a Bottle", "author": "Nicholas Sparks", "series": "", "ratings": "224465", "reviews": "4550", "rating": "3.97", "description": "Shimmering with suspense and emotional intensity - takes readers on a hunt for the truth about a man and his memories, and about both the heartbreaking fragility and enormous strength of love.Nicholas Sparks is our very best chronicler of the human heart. His stunning first novel, The Notebook, has been given by friend to friend and lover to lover all over the world as a t\nShimmering with suspense and emotional intensity - takes readers on a hunt for the truth about a man and his memories, and about both the heartbreaking fragility and enormous strength of love.Nicholas Sparks is our very best chronicler of the human heart. His stunning first novel, The Notebook, has been given by friend to friend and lover to lover all over the world as a testament to the timeless power of love. But if we thought he could never again move us so deeply, he now shows us he can-in a story that renews our faith in destiny...in the ability of true lovers to find each other no matter where, no matter when... Message In A Bottle Thrown to the waves, and to fate, the bottle could have ended up anywhere. Instead, it is found just three weeks after it begins its journey. Theresa Osborne, divorced and the mother of a twelve-year-old son, picks it up during a seaside vacation from her job as a Boston newspaper columnist. Inside is a letter that opens with: My Dearest Catherine, I miss you my darling, as I always do, but today is particularly hard because the ocean has been singing to me, and the song is that of our life together... For \"Garrett,\" the man who signs the letter, the message is the only way he knows to express his undying love for a woman he has lost. For Theresa, wary of romance since her husband shattered her trust, the message raises questions that intrigue her. Who are Garrett and Catherine? Where is he now? What is his story? Challenged by the mystery, and pulled to find Garrett by emotions she does not fully understand, Theresa begins a search that takes her to a sunlit coastal town and an unexpected confrontation. Brought together by chance-or something more powerful-Theresa and Garrett are people whose lives are about to touch for a purpose, in a tale that resonates with our deepest hopes for finding that special someone and everlasting love. Shimmering with suspense and emotional intensity, Message in a Bottle takes readers on a hunt for the truth about a man and his memories, and about both the heartbreaking fragility and enormous strength of love. For those who cherished The Notebook and readers waiting to discover the magic of Nicholas Sparks's storytelling, here is his new, achingly lovely novel of happenstance, desire, and the choices that matter most...\n", "genres": ["Womens Fiction", "Romance", "Adult", "Love", "Novels", "Fiction", "Chick Lit", "Adult Fiction", "Drama", "Contemporary Romance", "Contemporary"]}, "48862": {"bookid": "48862", "title": "Brighton Rock", "author": "Graham Greene", "series": "", "ratings": "29667", "reviews": "1703", "rating": "3.69", "description": "ISBN 9780099478478 moved to this edition.A gang war is raging through the dark underworld of Brighton. Seventeen-year-old Pinkie, malign and ruthless, has killed a man. Believing he can escape retribution, he is unprepared for the courageous, life-embracing Ida Arnold. Greene's gripping thriller, exposes a world of loneliness and fear, of life lived on the 'dangerous edge \nISBN 9780099478478 moved to this edition.A gang war is raging through the dark underworld of Brighton. Seventeen-year-old Pinkie, malign and ruthless, has killed a man. Believing he can escape retribution, he is unprepared for the courageous, life-embracing Ida Arnold. Greene's gripping thriller, exposes a world of loneliness and fear, of life lived on the 'dangerous edge of things'.WITH AN INTRODUCTION BY J.M. COETZEE\n", "genres": ["Modern Classics", "Classics", "Novels", "British Literature", "Fiction", "Literature", "Crime", "20th Century", "European Literature", "Thriller", "Mystery"]}, "714902": {"bookid": "714902", "title": "Noughts & Crosses", "author": "Malorie Blackman", "series": "(Noughts and Crosses #1)", "ratings": "62104", "reviews": "4597", "rating": "4.22", "description": "Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their \nTwo young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their world, Noughts and Crosses simply don’t mix. Against a background of prejudice and distrust, intensely highlighted by violent terrorist activity, a romance builds between Sephy and Callum -- a romance that is to lead both of them into terrible danger. Can they possibly find a way to be together?\n", "genres": ["Romance", "Teen", "Fantasy", "Race", "Dystopia", "Fiction", "Childrens", "Science Fiction", "Contemporary", "Young Adult"]}, "56650597": {"bookid": "56650597", "title": "The Top Five Teachings: An Asian Exploration of the Mysteries of Christ", "author": "Randy Loubier", "series": "", "ratings": "566", "reviews": "13", "rating": "4.17", "description": "The mysteries of Christ are meant to be explored by everyone. Every background, every race, every spiritual heritage is invited. Yet, it might not seem that way; Christianity can often seem foreign and awkward, even to Christians.The Tea Room Scrolls is a bridge in the Asian garden. At the height of the bridge, two groups of people will meet in this study: those familiar w\nThe mysteries of Christ are meant to be explored by everyone. Every background, every race, every spiritual heritage is invited. Yet, it might not seem that way; Christianity can often seem foreign and awkward, even to Christians.The Tea Room Scrolls is a bridge in the Asian garden. At the height of the bridge, two groups of people will meet in this study: those familiar with Asian spiritual traditions, and Christians wanting to explore Jesus’ teachings from a new vantage point. From the safety of the bridge, and with no pressure to step off the bridge, you will explore the mysteries of Jesus Christ in a fascinating format.Mankind has questions—about the purpose of life, the path of blessed living, the way to live in peace, the pursuit of abundant joy. The Tea Room Scrolls is a mindful and spiritual adventure you will never forget as you ponder Jesus’ answers to the most important questions of life.Come up onto the bridge and enjoy the view in this eight week self-study course.Best-selling author Randy Loubier spent 50 years pursuing the Asian spiritual traditions of Shinto, Taoism, Hindu and Buddhism, all the while convinced that Christians were weak people who were deluded by a book written by ancient kings to control the masses. When he finally read the Bible for himself, he discovered something extraordinary: Jesus’ teachings not only brought radical joy to his life, but are a far better fit to the Asian culture than the West! Your perspective is about to be stretched because...“Western Christians are often blind to some vital teachings of Jesus!”“Asian spiritualists are closer than they think to the Kingdom of Heaven!”Included in Volume 1:Vital Introductory MaterialThe Full Grid RevealedIn-Depth Study: Top Row\n", "genres": ["How To", "Education", "Drama", "Inspirational", "Book Club", "Contemporary", "Nonfiction"]}, "14058818": {"bookid": "14058818", "title": "Life... Love... Kumbh...", "author": "Aporva Kala", "series": "", "ratings": "2945", "reviews": "43", "rating": "3.54", "description": "The story in Life...Love...Kumbh... is told from the perspective of the three main characters- Annant, Agastaya, and Aditi. Their paths cross on January 13, 2010. It is the day before the first of the eleven sacred baths of the Haridwar Maha Kumbh.The three characters meet each other and exchange their stories. They remember the days gone by and are unsure about what lies \nThe story in Life...Love...Kumbh... is told from the perspective of the three main characters- Annant, Agastaya, and Aditi. Their paths cross on January 13, 2010. It is the day before the first of the eleven sacred baths of the Haridwar Maha Kumbh.The three characters meet each other and exchange their stories. They remember the days gone by and are unsure about what lies ahead.As the Kumbh Mela draws towards an end, all three of them are thrown into a challenging situation that they have to face. The book then follows their journey as they try and find answers for their personal quests all at the same time - on life, love, and the thirst for knowledge.\n", "genres": ["Romance", "Love", "Fantasy", "Spirituality", "Humor", "Literature", "Philosophy", "Fiction", "Mythology", "India", "Cultural", "Contemporary"]}, "20342617": {"bookid": "20342617", "title": "Just Mercy: A Story of Justice and Redemption", "author": "Bryan Stevenson", "series": "", "ratings": "192789", "reviews": "22351", "rating": "4.62", "description": "An unforgettable true story about the potential for mercy to redeem us, and a clarion call to end mass incarceration in America — from one of the most inspiring lawyers of our time.Bryan Stevenson was a young lawyer when he founded the Equal Justice Initiative, a nonprofit law office in Montgomery, Alabama, dedicated to defending the poor, the incarcerated, and the wrongly\nAn unforgettable true story about the potential for mercy to redeem us, and a clarion call to end mass incarceration in America — from one of the most inspiring lawyers of our time.Bryan Stevenson was a young lawyer when he founded the Equal Justice Initiative, a nonprofit law office in Montgomery, Alabama, dedicated to defending the poor, the incarcerated, and the wrongly condemned.Just Mercy tells the story of EJI, from the early days with a small staff facing the nation’s highest death sentencing and execution rates, through a successful campaign to challenge the cruel practice of sentencing children to die in prison, to revolutionary projects designed to confront Americans with our history of racial injustice.One of EJI’s first clients was Walter McMillian, a young Black man who was sentenced to die for the murder of a young white woman that he didn’t commit. The case exemplifies how the death penalty in America is a direct descendant of lynching — a system that treats the rich and guilty better than the poor and innocent.\n", "genres": ["History", "Race", "Autobiography", "Social Movements", "Social Justice", "Memoir", "Politics", "Audiobook", "Biography", "Law", "Anti Racist", "Nonfiction"]}, "2161733": {"bookid": "2161733", "title": "Child 44", "author": "Tom Rob Smith", "series": "(Leo Demidov #1)", "ratings": "81560", "reviews": "6615", "rating": "4.09", "description": "MGB officer Leo is a man who never questions the Party Line. He arrests whomever he is told to arrest. He dismisses the horrific death of a young boy because he is told to, because he believes the Party stance that there can be no murder in Communist Russia. Leo is the perfect soldier of the regime. But suddenly his confidence that everything he does serves a great good is\nMGB officer Leo is a man who never questions the Party Line. He arrests whomever he is told to arrest. He dismisses the horrific death of a young boy because he is told to, because he believes the Party stance that there can be no murder in Communist Russia. Leo is the perfect soldier of the regime. But suddenly his confidence that everything he does serves a great good is shaken. He is forced to watch a man he knows to be innocent be brutally tortured. And then he is told to arrest his own wife. Leo understands how the State works: Trust and check, but check particularly on those we trust. He faces a stark choice: his wife or his life. And still the killings of children continue...\n", "genres": ["Russia", "Fiction", "Crime", "Mystery Thriller", "Historical Fiction", "Audiobook", "Thriller", "Cultural", "Historical", "Suspense", "Mystery"]}, "17878917": {"bookid": "17878917", "title": "I, the Sun", "author": "Janet E. Morris", "series": "", "ratings": "407", "reviews": "76", "rating": "4.22", "description": "From palace coups in the lost city of Hattusas to treachery in the Egyptian court of Tutankhamun, I, the Sun, the saga of the Hittite king Suppiluliumas, rings with authenticity and the passion of a world that existed fourteen hundred years before the birth of Christ. They called him Great King, Favorite of the Storm God, the Valiant. He conquered more than forty nations a\nFrom palace coups in the lost city of Hattusas to treachery in the Egyptian court of Tutankhamun, I, the Sun, the saga of the Hittite king Suppiluliumas, rings with authenticity and the passion of a world that existed fourteen hundred years before the birth of Christ. They called him Great King, Favorite of the Storm God, the Valiant. He conquered more than forty nations and brought fear and war to the very doorstep of Eighteenth Dynasty Egypt, but he could not conquer the one woman he truly loved.\n", "genres": ["History", "Ancient", "Ancient History", "Fiction", "Literature", "Epic", "Adult Fiction", "Northern Africa", "Historical Fiction", "Biblical", "Egypt", "Historical"]}, "92364": {"bookid": "92364", "title": "Eye of the Needle", "author": "Ken Follett", "series": "", "ratings": "143460", "reviews": "3406", "rating": "4.19", "description": "One enemy spy knows the secret to the Allies' greatest deception, a brilliant aristocrat and ruthless assassin -- code name: \"The Needle\" -- who holds the key to ultimate Nazi victory. Only one person stands in his way: a lonely Englishwoman on an isolated island, who is beginning to love the killer who has mysteriously entered her life. All will come to a terrifying concl\nOne enemy spy knows the secret to the Allies' greatest deception, a brilliant aristocrat and ruthless assassin -- code name: \"The Needle\" -- who holds the key to ultimate Nazi victory. Only one person stands in his way: a lonely Englishwoman on an isolated island, who is beginning to love the killer who has mysteriously entered her life. All will come to a terrifying conclusion in Ken Follett's unsurpassed and unforgettable masterwork of suspense, intrigue, and the dangerous machinations of the human heart.\n", "genres": ["Spy Thriller", "Fiction", "Crime", "Mystery Thriller", "Historical Fiction", "Thriller", "War", "Historical", "Espionage", "World War II", "Suspense", "Mystery"]}, "35068432": {"bookid": "35068432", "title": "I'll Be Gone in the Dark: One Woman's Obsessive Search for the Golden State Killer", "author": "Michelle McNamara", "series": "", "ratings": "200717", "reviews": "17432", "rating": "4.12", "description": "A masterful true crime account of the Golden State Killer—the elusive serial rapist turned murderer who terrorized California for over a decade—from Michelle McNamara, the gifted journalist who died tragically while investigating the case.\"You’ll be silent forever, and I’ll be gone in the dark.\"For more than ten years, a mysterious and violent predator committed fifty sexu\nA masterful true crime account of the Golden State Killer—the elusive serial rapist turned murderer who terrorized California for over a decade—from Michelle McNamara, the gifted journalist who died tragically while investigating the case.\"You’ll be silent forever, and I’ll be gone in the dark.\"For more than ten years, a mysterious and violent predator committed fifty sexual assaults in Northern California before moving south, where he perpetrated ten sadistic murders. Then he disappeared, eluding capture by multiple police forces and some of the best detectives in the area.Three decades later, Michelle McNamara, a true crime journalist who created the popular website TrueCrimeDiary.com, was determined to find the violent psychopath she called \"the Golden State Killer.\" Michelle pored over police reports, interviewed victims, and embedded herself in the online communities that were as obsessed with the case as she was.At the time of the crimes, the Golden State Killer was between the ages of eighteen and thirty, Caucasian, and athletic—capable of vaulting tall fences. He always wore a mask. After choosing a victim—he favored suburban couples—he often entered their home when no one was there, studying family pictures, mastering the layout. He attacked while they slept, using a flashlight to awaken and blind them. Though they could not recognize him, his victims recalled his voice: a guttural whisper through clenched teeth, abrupt and threatening.I’ll Be Gone in the Dark—the masterpiece McNamara was writing at the time of her sudden death—offers an atmospheric snapshot of a moment in American history and a chilling account of a criminal mastermind and the wreckage he left behind. It is also a portrait of a woman’s obsession and her unflagging pursuit of the truth. Framed by an introduction by Gillian Flynn and an afterword by her husband, Patton Oswalt, the book was completed by Michelle’s lead researcher and a close colleague. Utterly original and compelling, it is destined to become a true crime classic—and may at last unmask the Golden State Killer.\n", "genres": ["Adult", "History", "Crime", "Autobiography", "Mystery Thriller", "Memoir", "Audiobook", "True Crime", "Thriller", "Nonfiction", "Mystery"]}, "469571": {"bookid": "469571", "title": "All the Pretty Horses", "author": "Cormac McCarthy", "series": "(The Border Trilogy #1)", "ratings": "103026", "reviews": "6879", "rating": "4.01", "description": "All the Pretty Horses tells of young John Grady Cole, the last of a long line of Texas ranchers. Across the border Mexico beckons—beautiful and desolate, rugged and cruelly civilized. With two companions, he sets off on an idyllic, sometimes comic adventure, to a place where dreams are paid for in", "genres": ["Literary Fiction", "Classics", "Novels", "Fiction", "Literature", "Historical Fiction", "American", "Historical", "Adventure", "Contemporary", "Westerns"]}, "231821": {"bookid": "231821", "title": "The Incredible Journey", "author": "Sheila Burnford", "series": "", "ratings": "50481", "reviews": "1124", "rating": "4.15", "description": "Instinct told them that the way home lay to the west. And so the doughty young Labrador retriever, the roguish bull terrier and the indomitable Siamese set out through the Canadian wilderness. Separately, they would soon have died. But, together, the three house pets faced starvation, exposure, and wild forest animals to make their way home to the family they love. The Inc\nInstinct told them that the way home lay to the west. And so the doughty young Labrador retriever, the roguish bull terrier and the indomitable Siamese set out through the Canadian wilderness. Separately, they would soon have died. But, together, the three house pets faced starvation, exposure, and wild forest animals to make their way home to the family they love. The Incredible Journey is one of the great children's stories of all time—and has been popular ever since its debut in 1961.\n", "genres": ["Animals", "Classics", "Cats", "Fiction", "Childrens", "Dogs", "Cultural", "Middle Grade", "Canada", "Adventure", "Young Adult"]}, "4502877": {"bookid": "4502877", "title": "Midnight Sun [2008 Draft]", "author": "Stephenie Meyer", "series": "", "ratings": "150205", "reviews": "9393", "rating": "4.01", "description": "The record for the completed novel can be found here. Midnight Sun is the much anticipated retelling of Twilight from Edward Cullen's perspective. An unedited partial draft was illegally leaked onto the internet in 2008; consequently, author Stephenie Meyer put the project on indefinite hold. Shortly afterward, she posted a letter to her fans on her website including a lin\nThe record for the completed novel can be found here. Midnight Sun is the much anticipated retelling of Twilight from Edward Cullen's perspective. An unedited partial draft was illegally leaked onto the internet in 2008; consequently, author Stephenie Meyer put the project on indefinite hold. Shortly afterward, she posted a letter to her fans on her website including a link to the entire partial draft of the book so that those who wanted to read it could do so legally and with her consent. Note: Do not add a cover. Do not add translations. Do not add any other editions. Do not combine with editions of the full work. Do not add this book record to any series.\n", "genres": ["Romance", "Teen", "Fantasy", "Fiction", "Paranormal", "Paranormal Romance", "Vampires", "Supernatural", "Urban Fantasy", "Young Adult"]}, "30244626": {"bookid": "30244626", "title": "4 3 2 1", "author": "Paul Auster", "series": "", "ratings": "25190", "reviews": "3699", "rating": "3.94", "description": "Nearly two weeks early, on March 3, 1947, in the maternity ward of Beth Israel Hospital in Newark, New Jersey, Archibald Isaac Ferguson, the one and only child of Rose and Stanley Ferguson, is born. From that single beginning, Ferguson’s life will take four simultaneous and independent fictional paths. Four identical Fergusons made of the same DNA, four boys who are the sa\nNearly two weeks early, on March 3, 1947, in the maternity ward of Beth Israel Hospital in Newark, New Jersey, Archibald Isaac Ferguson, the one and only child of Rose and Stanley Ferguson, is born. From that single beginning, Ferguson’s life will take four simultaneous and independent fictional paths. Four identical Fergusons made of the same DNA, four boys who are the same boy, go on to lead four parallel and entirely different lives. Family fortunes diverge. Athletic skills and sex lives and friendships and intellectual passions contrast. Each Ferguson falls under the spell of the magnificent Amy Schneiderman, yet each Amy and each Ferguson have a relationship like no other. Meanwhile, readers will take in each Ferguson’s pleasures and ache from each Ferguson’s pains, as the mortal plot of each Ferguson’s life rushes on.As inventive and dexterously constructed as anything Paul Auster has ever written, yet with a passion for realism and a great tenderness and fierce attachment to history and to life itself that readers have never seen from Auster before. 4 3 2 1 is a marvelous and unforgettably affecting tour de force.\n", "genres": ["Literary Fiction", "Novels", "Fiction", "Literature", "The United States Of America", "Historical Fiction", "Audiobook", "Historical", "Americana", "Contemporary", "American"]}, "13912": {"bookid": "13912", "title": "A Beautiful Mind", "author": "Sylvia Nasar", "series": "", "ratings": "129119", "reviews": "1540", "rating": "4.13", "description": "Stories of famously eccentric Princetonians abound—such as that of chemist Hubert Alyea, the model for The Absent-Minded Professor, or Ralph Nader, said to have had his own key to the library as an undergraduate. Or the \"Phantom of Fine Hall,\" a figure many students had seen shuffling around the corridors of the math and physics building wearing purple sneakers and writing\nStories of famously eccentric Princetonians abound—such as that of chemist Hubert Alyea, the model for The Absent-Minded Professor, or Ralph Nader, said to have had his own key to the library as an undergraduate. Or the \"Phantom of Fine Hall,\" a figure many students had seen shuffling around the corridors of the math and physics building wearing purple sneakers and writing numerology treatises on the blackboards. The Phantom was John Nash, one of the most brilliant mathematicians of his generation, who had spiraled into schizophrenia in the 1950s. His most important work had been in game theory, which by the 1980s was underpinning a large part of economics. When the Nobel Prize committee began debating a prize for game theory, Nash's name inevitably came up—only to be dismissed, since the prize clearly could not go to a madman. But in 1994 Nash, in remission from schizophrenia, shared the Nobel Prize in economics for work done some 45 years previously.Economist and journalist Sylvia Nasar has written a biography of Nash that looks at all sides of his life. She gives an intelligent, understandable exposition of his mathematical ideas and a picture of schizophrenia that is evocative but decidedly unromantic. Her story of the machinations behind Nash's Nobel is fascinating and one of very few such accounts available in print (the CIA could learn a thing or two from the Nobel committees).\n", "genres": ["History", "Science", "Mental Health", "Media Tie In", "Health", "Autobiography", "Biography Memoir", "Memoir", "Psychology", "Biography", "Mathematics", "Nonfiction"]}, "7631105": {"bookid": "7631105", "title": "The Scorch Trials", "author": "James Dashner", "series": "(The Maze Runner #2)", "ratings": "513389", "reviews": "27936", "rating": "3.90", "description": "Solving the Maze was supposed to be the end.    Thomas was sure that escape from the Maze would mean freedom for him and the Gladers. But WICKED isn’t done yet. Phase Two has just begun. The Scorch.   There are no rules. There is no help. You either make it or you die.   The Gladers have two weeks to cross through the Scorch—the most burned-out section of the world. And WI\nSolving the Maze was supposed to be the end.    Thomas was sure that escape from the Maze would mean freedom for him and the Gladers. But WICKED isn’t done yet. Phase Two has just begun. The Scorch.   There are no rules. There is no help. You either make it or you die.   The Gladers have two weeks to cross through the Scorch—the most burned-out section of the world. And WICKED has made sure to adjust the variables and stack the odds against them.   Friendships will be tested. Loyalties will be broken. All bets are off.    There are others now. Their survival depends on the Gladers’ destruction—and they’re determined to survive.\n", "genres": ["Teen", "Apocalyptic", "Fantasy", "Dystopia", "Fiction", "Science Fiction", "Audiobook", "Post Apocalyptic", "Adventure", "Mystery", "Young Adult"]}, "32620332": {"bookid": "32620332", "title": "The Seven Husbands of Evelyn Hugo", "author": "Taylor Jenkins Reid", "series": "", "ratings": "1032317", "reviews": "119401", "rating": "4.48", "description": "Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?Monique is not exactly on top of the world. Her husband has left her, and her professional life is going now\nAging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?Monique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career.Summoned to Evelyn’s luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the ‘80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn’s story near its conclusion, it becomes clear that her life intersects with Monique’s own in tragic and irreversible ways.\n", "genres": ["Romance", "Adult", "Fiction", "Lesbian", "LGBT", "Queer", "Historical Fiction", "Audiobook", "Historical", "Contemporary"]}, "48464": {"bookid": "48464", "title": "A Good Man Is Hard to Find and Other Stories", "author": "Flannery O'Connor", "series": "", "ratings": "41867", "reviews": "2642", "rating": "4.20", "description": "This now classic book revealed Flannery O'Connor as one of the most original and provocative writers to emerge from the South. Her apocalyptic vision of life is expressed through grotesque, often comic situations in which the principal character faces a problem of salvation: the grandmother, in the title story, confronting the murderous Misfit; a neglected four-year-old bo\nThis now classic book revealed Flannery O'Connor as one of the most original and provocative writers to emerge from the South. Her apocalyptic vision of life is expressed through grotesque, often comic situations in which the principal character faces a problem of salvation: the grandmother, in the title story, confronting the murderous Misfit; a neglected four-year-old boy looking for the Kingdom of Christ in the fast-flowing waters of the river; General Sash, about to meet the final enemy. Stories include:\"A Good Man Is Hard to Find\"\"The River\"\"The Life You Save May Be Your Own\"\"A Stroke of Good Fortune\"\"A Temple of the Holy Ghost\"\"The Artificial Nigger\"\"A Circle in the Fire\"\"A Late Encounter with the Enemy\"\"Good Country People\"\"The Displaced Person\"©1955 Flannery O'Connor; 1954, 1953, 1948 by Flannery O'Connor; renewed 1983, 1981 by Regina O'Connor; renewed 1976 by Mrs. Edward F. O'Connor; (P)2010 Blackstone Audio, Inc.\n", "genres": ["Literary Fiction", "Southern Gothic", "Classics", "20th Century", "Fiction", "Literature", "Gothic", "Southern", "Short Stories", "American"]}, "18111281": {"bookid": "18111281", "title": "A Long Way Home", "author": "Saroo Brierley", "series": "", "ratings": "59238", "reviews": "4858", "rating": "4.10", "description": "When Saroo Brierley used Google Earth to find his long-lost home town half a world away, he made global headlines.Saroo had become lost on a train in India at the age of five. Not knowing the name of his family or where he was from, he survived for weeks on the streets of Kolkata, before being taken into an orphanage and adopted by a couple in Australia.Despite being happy\nWhen Saroo Brierley used Google Earth to find his long-lost home town half a world away, he made global headlines.Saroo had become lost on a train in India at the age of five. Not knowing the name of his family or where he was from, he survived for weeks on the streets of Kolkata, before being taken into an orphanage and adopted by a couple in Australia.Despite being happy in his new family, Saroo always wondered about his origins. He spent hours staring at the map of India on his bedroom wall. When he was a young man the advent of Google Earth led him to pore over satellite images of the country for landmarks he recognised. And one day, after years of searching, he miraculously found what he was looking for.Then he set off on a journey to find his mother.\n", "genres": ["Asia", "Autobiography", "Parenting", "India", "Memoir", "Audiobook", "Adoption", "Biography", "Cultural", "Biography Memoir", "Australia", "Nonfiction"]}, "51738": {"bookid": "51738", "title": "Just Listen", "author": "Sarah Dessen", "series": "", "ratings": "242768", "reviews": "8468", "rating": "4.05", "description": "Last year, Annabel was \"the girl who has everything\" — at least that's the part she played in the television commercial for Kopf's Department Store.This year, she's the girl who has nothing: no best friend because mean-but-exciting Sophie dropped her, no peace at home since her older sister became anorexic, and no one to sit with at lunch. Until she meets Owen Armstrong.Ta\nLast year, Annabel was \"the girl who has everything\" — at least that's the part she played in the television commercial for Kopf's Department Store.This year, she's the girl who has nothing: no best friend because mean-but-exciting Sophie dropped her, no peace at home since her older sister became anorexic, and no one to sit with at lunch. Until she meets Owen Armstrong.Tall, dark, and music-obsessed, Owen is a reformed bad boy with a commitment to truth-telling. With Owen's help, maybe Annabel can face what happened the night she and Sophie stopped being friends.\n", "genres": ["Womens Fiction", "Romance", "Teen", "Music", "Fiction", "Chick Lit", "Realistic Fiction", "Young Adult Contemporary", "High School", "Contemporary", "Young Adult"]}, "18812405": {"bookid": "18812405", "title": "The Good Girl", "author": "Mary Kubica", "series": "", "ratings": "215784", "reviews": "16206", "rating": "3.82", "description": "I've been following her for the past few days. I know where she buys her groceries, where she works. I don't know the color of her eyes or what they look like when she's scared. But I will.One night, Mia Dennett enters a bar to meet her on-again, off-again boyfriend. But when he doesn't show, she unwisely leaves with an enigmatic stranger. At first Colin Thatcher seems lik\nI've been following her for the past few days. I know where she buys her groceries, where she works. I don't know the color of her eyes or what they look like when she's scared. But I will.One night, Mia Dennett enters a bar to meet her on-again, off-again boyfriend. But when he doesn't show, she unwisely leaves with an enigmatic stranger. At first Colin Thatcher seems like a safe one-night stand. But following Colin home will turn out to be the worst mistake of Mia's life. When Colin decides to hide Mia in a secluded cabin in rural Minnesota instead of delivering her to his employers, Mia's mother, Eve, and detective Gabe Hoffman will stop at nothing to find them. But no one could have predicted the emotional entanglements that eventually cause this family's world to shatter.\n", "genres": ["Adult", "Fiction", "Crime", "Mystery Thriller", "Audiobook", "Thriller", "Psychological Thriller", "Contemporary", "Suspense", "Mystery"]}, "284440": {"bookid": "284440", "title": "Skulduggery Pleasant", "author": "Derek Landy", "series": "(Skulduggery Pleasant #1)", "ratings": "60027", "reviews": "4755", "rating": "4.16", "description": "Meet Skulduggery PleasantAce DetectiveSnappy DresserRazor–tongued WitCrackerjack SorcererandWalking, Talking, Fire-throwing Skeleton—as well as ally, protector, and mentor of Stephanie Edgley, a very unusual and darkly talented twelve-year-old.These two alone must defeat an all-consuming ancient evil.The end of the world?Over his dea", "genres": ["Fantasy", "Fiction", "Childrens", "Magic", "Paranormal", "Urban Fantasy", "Middle Grade", "Adventure", "Mystery", "Young Adult"]}, "32999129": {"bookid": "32999129", "title": "I Miss The World", "author": "Violet LeVoit", "series": "", "ratings": "381", "reviews": "44", "rating": "3.74", "description": "\"LeVoit's work exists at the center of a glowing nexus where fever dream punk rock poetry collides with raw emotion and vertiginous talent.\" --Jeremy Robert Johnson, author of Skullcrack CitySet in and around Hollywood Forever Cemetery, this tense and mind-bending noir is Violet LeVoit at her finest: an unnerving, unpredictable and comic journey through deep trauma and gli\n\"LeVoit's work exists at the center of a glowing nexus where fever dream punk rock poetry collides with raw emotion and vertiginous talent.\" --Jeremy Robert Johnson, author of Skullcrack CitySet in and around Hollywood Forever Cemetery, this tense and mind-bending noir is Violet LeVoit at her finest: an unnerving, unpredictable and comic journey through deep trauma and glitzy nostalgic insanity.\"I Miss The World is a gut-punch, throat-punch, heart- punch of a novel. LeVoit knows how to seduce you with a lullaby when she's going for blood.\" --Danger Slater, author of Puppet Skin\"It is masterful, it is beautiful and awful, it is sweepingly and breathtakingly artistic, the impact of seeing some great natural wonder or work of art for the first time.\" --The Horror Fiction Review\"Revelatory, gut-punching, brilliantly anarchic perfection.\" --J David Osborne, author of Black Gum\n", "genres": ["Fiction", "Crime", "Horror", "Mystery"]}, "27213168": {"bookid": "27213168", "title": "I Contain Multitudes: The Microbes Within Us and a Grander View of Life", "author": "Ed Yong", "series": "", "ratings": "20030", "reviews": "2290", "rating": "4.15", "description": "Every animal, whether human, squid, or wasp, is home to millions of bacteria and other microbes. Many people think of microbes as germs to be eradicated, but those that live with us—the microbiome—build our bodies, protect our health, shape our identities, and grant us incredible abilities. In this astonishing book, Ed Yong takes us on a grand tour through our microbial pa\nEvery animal, whether human, squid, or wasp, is home to millions of bacteria and other microbes. Many people think of microbes as germs to be eradicated, but those that live with us—the microbiome—build our bodies, protect our health, shape our identities, and grant us incredible abilities. In this astonishing book, Ed Yong takes us on a grand tour through our microbial partners, and introduces us to the scientists on the front lines of discovery. Yong, whose humor is as evident as his erudition, prompts us to look at ourselves and our animal companions in a new light—less as individuals and more as the interconnected, interdependent multitudes we assuredly are. The microbes in our bodies are part of our immune systems and protect us from disease. Those in cows and termites digest the plants they eat. In the deep oceans, mysterious creatures without mouths or guts depend on microbes for all their energy. Bacteria provide squids with invisibility cloaks, help beetles to bring down forests, and allow worms to cause diseases that afflict millions of people. I Contain Multitudes is the story of these extraordinary partnerships, between the creatures we are familiar with and those we are not. It reveals how we humans are disrupting these partnerships and how we might manipulate them for our own good. It will change both our view of nature and our sense of where we belong in it.\n", "genres": ["Science", "Biology", "Medicine", "Popular Science", "Health", "Environment", "Medical", "Evolution", "Audiobook", "Nature", "Nonfiction"]}, "44442886": {"bookid": "44442886", "title": "Never Go With Your Gut: How Pioneering Leaders Make the Best Decisions and Avoid Business Disasters (Avoid Terrible Advice, Cognitive Biases, and Poor Decisions)", "author": "Gleb Tsipursky", "series": "", "ratings": "175", "reviews": "82", "rating": "4.23", "description": "Avoid terrible advice, cognitive biases, and poor decisions. Want to avoid business disasters, whether minor mishaps, such as excessive team conflict, or major calamities like those that threaten bankruptcy or doom a promising career? Fortunately, behavioral economics studies show that such disasters stem from poor decisions due to our faulty mental patterns—what scholars \nAvoid terrible advice, cognitive biases, and poor decisions. Want to avoid business disasters, whether minor mishaps, such as excessive team conflict, or major calamities like those that threaten bankruptcy or doom a promising career? Fortunately, behavioral economics studies show that such disasters stem from poor decisions due to our faulty mental patterns—what scholars call “cognitive biases”—and are preventable.Unfortunately, the typical advice for business leaders to “go with their guts” plays into these cognitive biases and leads to disastrous decisions that devastate the bottom line. By combining practical case studies with cutting-edge research, Never Go With Your Gut will help you make the best decisions and prevent these business disasters.The leading expert on avoiding business disasters, Dr. Gleb Tsipursky, draws on over 20 years of extensive consulting, coaching, and speaking experience to show how pioneering leaders and organizations—many of them his clients—avoid business disasters. Reading this book will enable you to:Discover how pioneering leaders and organizations address cognitive biases to avoid disastrous decisions.Adapt best practices on avoiding business disasters from these leaders and organizations to your own context.Develop processes that empower everyone in your organization to avoid business disasters.\n", "genres": ["Management", "Leadership", "Science", "Buisness", "Culture", "Personal Development", "Psychology", "Business", "Self Help", "Society", "Nonfiction"]}, "46114": {"bookid": "46114", "title": "The Waves", "author": "Virginia Woolf", "series": "", "ratings": "33870", "reviews": "3178", "rating": "4.15", "description": "Set on the coast of England against the vivid background of the sea, The Waves introduces six characters—three men and three women—who are grappling with the death of a beloved friend, Percival. Instead of describing their outward expressions of grief, Virginia Woolf draws her characters from the inside, revealing them through their thoughts and interior soliloquies. As th\nSet on the coast of England against the vivid background of the sea, The Waves introduces six characters—three men and three women—who are grappling with the death of a beloved friend, Percival. Instead of describing their outward expressions of grief, Virginia Woolf draws her characters from the inside, revealing them through their thoughts and interior soliloquies. As their understanding of nature’s trials grows, the chorus of narrative voices blends together in miraculous harmony, remarking not only on the inevitable death of individuals but on the eternal connection of everyone. The novel that most epitomizes Virginia Woolf’s theories of fiction in the working form, The Waves is an amazing book very much ahead of its time. It is a poetic dreamscape, visual, experimental, and thrilling.\n", "genres": ["Literary Fiction", "Modern Classics", "20th Century", "Classics", "Novels", "Fiction", "Literature", "British Literature", "European Literature", "Poetry", "English Literature"]}, "25669": {"bookid": "25669", "title": "How the Irish Saved Civilization: The Untold Story of Ireland's Heroic Role from the Fall of Rome to the Rise of Medieval Europe", "author": "Thomas Cahill", "series": "(The Hinges of History #1)", "ratings": "43035", "reviews": "1885", "rating": "3.81", "description": "From the fall of Rome to the rise of Charlemagne - the \"dark ages\" - learning, scholarship, and culture disappeared from the European continent. The great heritage of western civilization - from the Greek and Roman classics to Jewish and Christian works - would have been utterly lost were it not for the holy men and women of unconquered Ireland. In this delightful and illu\nFrom the fall of Rome to the rise of Charlemagne - the \"dark ages\" - learning, scholarship, and culture disappeared from the European continent. The great heritage of western civilization - from the Greek and Roman classics to Jewish and Christian works - would have been utterly lost were it not for the holy men and women of unconquered Ireland. In this delightful and illuminating look into a crucial but little-known \"hinge\" of history, Thomas Cahill takes us to the \"island of saints and scholars, \" the Ireland of St. Patrick and the Book of Kells. Here, far from the barbarian despoliation of the continent, monks and scribes laboriously, lovingly, even playfully preserved the west's written treasures. With the return of stability in Europe, these Irish scholars were instrumental in spreading learning. Thus the Irish not only were conservators of civilization, but became shapers of the medieval mind, putting their unique stamp on western culture.\n", "genres": ["European History", "Ireland", "History", "Medieval", "World History", "European Literature", "Christianity", "Cultural", "Historical", "Religion", "Nonfiction", "Irish Literature"]}, "8737": {"bookid": "8737", "title": "The Last Temptation of Christ", "author": "Nikos Kazantzakis", "series": "", "ratings": "13160", "reviews": "941", "rating": "4.17", "description": "The internationally renowned novel about the life and death of Jesus Christ.Hailed as a masterpiece by critics worldwide, The Last Temptation of Christ is a monumental reinterpretation of the Gospels that brilliantly fleshes out Christ’s Passion. This literary rendering of the life of Jesus Christ has courted controversy since its publication by depicting a Christ far more\nThe internationally renowned novel about the life and death of Jesus Christ.Hailed as a masterpiece by critics worldwide, The Last Temptation of Christ is a monumental reinterpretation of the Gospels that brilliantly fleshes out Christ’s Passion. This literary rendering of the life of Jesus Christ has courted controversy since its publication by depicting a Christ far more human than the one seen in the Bible. He is a figure who is gloriously divine but earthy and human, a man like any other—subject to fear, doubt, and pain.  In elegant, thoughtful prose Nikos Kazantzakis, one of the greats of modern literature, follows this Jesus as he struggles to live out God’s will for him, powerfully suggesting that it was Christ’s ultimate triumph over his flawed humanity, when he gave up the temptation to run from the cross and willingly laid down his life for mankind, that truly made him the venerable redeemer of men.  “Spiritual dynamite.” —San Francisco Chronicle  “A searing, soaring, shocking novel.” —Time \n", "genres": ["Classics", "Novels", "Fiction", "Literature", "Spirituality", "Philosophy", "Greece", "Historical Fiction", "Cultural", "Historical", "Religion", "Christianity"]}, "15818107": {"bookid": "15818107", "title": "Orphan Train", "author": "Christina Baker Kline", "series": "", "ratings": "408394", "reviews": "30834", "rating": "4.18", "description": "This is an alternate cover edition of ISBN 9780061950728, found here.The author of Bird in Hand and The Way Life Should Be delivers her most ambitious and powerful novel to date: a captivating story of two very different women who build an unexpected friendship: a 91-year-old woman with a hidden past as an orphan-train rider and the teenage girl whose own troubled adolesce\nThis is an alternate cover edition of ISBN 9780061950728, found here.The author of Bird in Hand and The Way Life Should Be delivers her most ambitious and powerful novel to date: a captivating story of two very different women who build an unexpected friendship: a 91-year-old woman with a hidden past as an orphan-train rider and the teenage girl whose own troubled adolescence leads her to seek answers to questions no one has ever thought to ask.Nearly eighteen, Molly Ayer knows she has one last chance. Just months from \"aging out\" of the child welfare system, and close to being kicked out of her foster home, a community service position helping an elderly woman clean out her home is the only thing keeping her out of juvie and worse.Vivian Daly has lived a quiet life on the coast of Maine. But in her attic, hidden in trunks, are vestiges of a turbulent past. As she helps Vivian sort through her possessions and memories, Molly discovers that she and Vivian aren't as different as they seem to be. A young Irish immigrant orphaned in New York City, Vivian was put on a train to the Midwest with hundreds of other children whose destinies would be determined by luck and chance.The closer Molly grows to Vivian, the more she discovers parallels to her own life. A Penobscot Indian, she, too, is an outsider being raised by strangers, and she, too, has unanswered questions about the past. As her emotional barriers begin to crumble, Molly discovers that she has the power to help Vivian find answers to mysteries that have haunted her for her entire life - answers that will ultimately free them both.Rich in detail and epic in scope, Orphan Train is a powerful novel of upheaval and resilience, of second chances, of unexpected friendship, and of the secrets we carry that keep us from finding out who we are.\n", "genres": ["Adult", "Fiction", "Parenting", "Adult Fiction", "Adoption", "Historical Fiction", "Audiobook", "Historical", "Book Club", "Contemporary", "Young Adult"]}, "184419": {"bookid": "184419", "title": "The Man Who Was Thursday: A Nightmare", "author": "G.K. Chesterton", "series": "", "ratings": "36496", "reviews": "3523", "rating": "3.82", "description": "G. K. Chesterton's surreal masterpiece is a psychological thriller that centers on seven anarchists in turn-of-the-century London who call themselves by the names of the days of the week. Chesterton explores the meanings of their disguised identities in what is a fascinating mystery and, ultimately, a spellbinding allegory.As Jonathan Lethem remarks in his Introduction, Th\nG. K. Chesterton's surreal masterpiece is a psychological thriller that centers on seven anarchists in turn-of-the-century London who call themselves by the names of the days of the week. Chesterton explores the meanings of their disguised identities in what is a fascinating mystery and, ultimately, a spellbinding allegory.As Jonathan Lethem remarks in his Introduction, The real characters are the ideas. Chesterton's nutty agenda is really quite simple: to expose moral relativism and parlor nihilism for the devils he believes them to be. This wouldn't be interesting at all, though, if he didn't also show such passion for giving the devil his due. He animates the forces of chaos and anarchy with every ounce of imaginative verve and rhetorical force in his body.\n", "genres": ["Classics", "Fantasy", "Novels", "Fiction", "Literature", "British Literature", "Philosophy", "European Literature", "Thriller", "Christian", "Mystery"]}, "672948": {"bookid": "672948", "title": "Arch of Triumph: A Novel of a Man Without a Country", "author": "Erich Maria Remarque", "series": "", "ratings": "22300", "reviews": "706", "rating": "4.42", "description": "It is 1939. Despite a law banning him from performing surgery, Ravic – a German doctor and refugee living in Paris – has been treating some of the city’s most elite citizens for two years on the behalf of two less-than-skillful French physicians.Forbidden to return to his own country, and dodging the everyday dangers of jail and deportation, Ravic manages to hang on – all \nIt is 1939. Despite a law banning him from performing surgery, Ravic – a German doctor and refugee living in Paris – has been treating some of the city’s most elite citizens for two years on the behalf of two less-than-skillful French physicians.Forbidden to return to his own country, and dodging the everyday dangers of jail and deportation, Ravic manages to hang on – all the while searching for the Nazi who tortured him back in Germany. And though he’s given up on the possibility of love, life has a curious way of taking a turn for the romantic, even during the worst of times…\n", "genres": ["Romance", "Classics", "Novels", "Fiction", "Literature", "European Literature", "Germany", "Historical Fiction", "German Literature", "War", "Cultural", "Historical"]}, "1971304": {"bookid": "1971304", "title": "City of Thieves", "author": "David Benioff", "series": "", "ratings": "134078", "reviews": "12562", "rating": "4.27", "description": "During the Nazis’ brutal siege of Leningrad, Lev Beniov is arrested for looting and thrown into the same cell as a handsome deserter named Kolya. Instead of being executed, Lev and Kolya are given a shot at saving their own lives by complying with an outrageous directive: secure a dozen eggs for a powerful Soviet colonel to use in his daughter’s wedding cake. In a city cut\nDuring the Nazis’ brutal siege of Leningrad, Lev Beniov is arrested for looting and thrown into the same cell as a handsome deserter named Kolya. Instead of being executed, Lev and Kolya are given a shot at saving their own lives by complying with an outrageous directive: secure a dozen eggs for a powerful Soviet colonel to use in his daughter’s wedding cake. In a city cut off from all supplies and suffering unbelievable deprivation, Lev and Kolya embark on a hunt through the dire lawlessness of Leningrad and behind enemy lines to find the impossible.By turns insightful and funny, thrilling and terrifying, City of Thieves is a gripping, cinematic World War II adventure and an intimate coming-of-age story with an utterly contemporary feel for how boys become men.\n", "genres": ["Adult", "Russia", "Novels", "Fiction", "Historical Fiction", "Audiobook", "Cultural", "War", "Adventure", "Historical", "World War II"]}, "18136883": {"bookid": "18136883", "title": "Touch Me", "author": "T.H. Snyder", "series": "(Touch #1)", "ratings": "760", "reviews": "186", "rating": "3.76", "description": "Char is a focused and driven career woman who's had a relationship she would rather choose to forget, but can't. Riley is a pure gentleman who can easily leave the past where it belongs, behind him.Some people believe in fate where others deem it a coincidence. Char and Riley are meant to be together, so life just happens to make sure they are in the right place at the rig\nChar is a focused and driven career woman who's had a relationship she would rather choose to forget, but can't. Riley is a pure gentleman who can easily leave the past where it belongs, behind him.Some people believe in fate where others deem it a coincidence. Char and Riley are meant to be together, so life just happens to make sure they are in the right place at the right time. But is that enough? You’ll be falling in love with this dynamic duo as they find out who they are and why fate keeps making sure their lives are intertwined. Their differences are what make them all too similar, and throughout the course of their journey there is one thing that always brings them back together...the need for each other's touch.\n", "genres": ["Womens Fiction", "Romance", "Chick Lit", "Humor", "New Adult", "Adult Fiction", "Erotica", "Amazon", "Business", "Contemporary Romance", "Contemporary"]}, "759945": {"bookid": "759945", "title": "The Magic of Thinking Big", "author": "David J. Schwartz", "series": "", "ratings": "81113", "reviews": "2803", "rating": "4.24", "description": "The Magic of Thinking Big gives you useful methods, not empty promises. Dr. Schwartz presents a carefully designed program for getting the most out of your job, your marriage and family life, and your community. He proves that you don't need to be an intellectual or have innate talent to attain great success and satisfaction, but you do need to learn and understand the hab\nThe Magic of Thinking Big gives you useful methods, not empty promises. Dr. Schwartz presents a carefully designed program for getting the most out of your job, your marriage and family life, and your community. He proves that you don't need to be an intellectual or have innate talent to attain great success and satisfaction, but you do need to learn and understand the habit of thinking and behaving in ways that will get you there.\n", "genres": ["Leadership", "Entrepreneurship", "Philosophy", "Audiobook", "Personal Development", "Psychology", "Business", "Self Help", "Productivity", "Nonfiction"]}, "12142040": {"bookid": "12142040", "title": "Profile", "author": "C.D. Blizzard", "series": "", "ratings": "25", "reviews": "2", "rating": "3.92", "description": "Special Agent Joe Cross of the Federal Bureau of Investigations scrambles to find a killer who represents his biggest failure to date. Twelve years ago, a man killed a young girl and got away with it. Now he's at it again. But this time Joe is determined not to fail. Leaving his family behind, he travels to Florida and begins the arduous task of sifting through impossible \nSpecial Agent Joe Cross of the Federal Bureau of Investigations scrambles to find a killer who represents his biggest failure to date. Twelve years ago, a man killed a young girl and got away with it. Now he's at it again. But this time Joe is determined not to fail. Leaving his family behind, he travels to Florida and begins the arduous task of sifting through impossible evidence in an unfamiliar environment. The killer expertly evades the local talent, leaving nothing behind as evidence, but his obsession with a woman of innocent appeal may become his inevitable ruin. As the killer slowly loses himself in the strong urges to kill, he fights for normalcy, despising that part of himself that he keeps hidden from the world, wanting what he knows he can never have. Only his victims know his identity, and they aren't speaking anymore. He's never failed, and he's convinced he never will. He is untouchable, untraceable, unstoppable.\n", "genres": ["Thriller"]}, "186190": {"bookid": "186190", "title": "Forrest Gump", "author": "Winston Groom", "series": "(Forrest Gump #1)", "ratings": "63730", "reviews": "2735", "rating": "4.04", "description": "Meet Forrest Gump, the lovable, herculean, and surprisingly savvy hero of this remarkable comic odyssey. After accidentally becoming the star of University of Alabama's football team, Forrest goes on to become a Vietnam War hero, a world-class Ping-Pong player, a villainous wrestler, and a business tycoon -- as he wonders with childlike wisdom at the insanity all around hi\nMeet Forrest Gump, the lovable, herculean, and surprisingly savvy hero of this remarkable comic odyssey. After accidentally becoming the star of University of Alabama's football team, Forrest goes on to become a Vietnam War hero, a world-class Ping-Pong player, a villainous wrestler, and a business tycoon -- as he wonders with childlike wisdom at the insanity all around him. In between misadventures, he manages to compare battle scars with Lyndon Johnson, discover the truth about Richard Nixon, and survive the ups and downs of remaining true to his only love, Jenny, on an extraordinary journey through three decades of the American cultural landscape. Forrest Gump has one heck of a story to tell -- and you've got to read it to believe it...\n", "genres": ["Classics", "Novels", "Fiction", "Humor", "Media Tie In", "Drama", "Historical Fiction", "Historical", "Adventure", "Contemporary"]}, "13530588": {"bookid": "13530588", "title": "China Blues", "author": "Ki Longfellow", "series": "", "ratings": "1510", "reviews": "99", "rating": "4.14", "description": "The Roaring Twenties, Chinatown, San Francisco: back-street blues and bathtub gin… hardball mobsters and hardheaded cops… seductive speakeasies and sizzling scandals. As the young Louis Armstrong blows his horn in the infamous Blue Canary, impetuous Nob Hill Socialite Elizabeth Stafford Hamilton plunges into a reckless affair with mysterious Li Kwan Won. Unknown to Lizzie,\nThe Roaring Twenties, Chinatown, San Francisco: back-street blues and bathtub gin… hardball mobsters and hardheaded cops… seductive speakeasies and sizzling scandals. As the young Louis Armstrong blows his horn in the infamous Blue Canary, impetuous Nob Hill Socialite Elizabeth Stafford Hamilton plunges into a reckless affair with mysterious Li Kwan Won. Unknown to Lizzie, Li is the overlord of the city’s vast bootlegging empire—and archenemy of her powerful husband, the San Francisco district attorney. Suddenly Lizzie’s privileged, upper-crust life is shadowed by danger and intrigue—as she’s trapped between her lover and her husband while they battle for control of the city.Eio Books has reissued Ki Longfellow's first novel, published by Harper Collins in England in 1989.\n", "genres": ["Novels", "Fiction", "Literature", "Crime", "Mystery Thriller", "Historical Fiction", "Historical Mystery", "Thriller", "Historical", "Mystery"]}, "82346": {"bookid": "82346", "title": "The Two Gentlemen of Verona", "author": "William Shakespeare", "series": "", "ratings": "13925", "reviews": "936", "rating": "3.40", "description": "While the word “gentlemen” suggests that its heroes are adults, The Two Gentlemen of Verona is more intelligible if we think of them as boys, leaving home for the first time. One has a crush on a girl, Julia, though he hasn’t yet told her. Sent to court to learn to be “perfect gentlemen,” Valentine and Proteus are derailed by their attraction to Sylvia, the ruler’s daughte\nWhile the word “gentlemen” suggests that its heroes are adults, The Two Gentlemen of Verona is more intelligible if we think of them as boys, leaving home for the first time. One has a crush on a girl, Julia, though he hasn’t yet told her. Sent to court to learn to be “perfect gentlemen,” Valentine and Proteus are derailed by their attraction to Sylvia, the ruler’s daughter. Valentine’s mental denseness does not deter Sylvia from returning his love, but he is caught, and banished, when he tries to elope with her. Proteus’s desire for Sylvia wipes out his former love, leading him into despicable acts that win scorn from Sylvia and wound Julia, who has pursued him disguised as a boy. When Sylvia follows Valentine into banishment, Proteus follows Sylvia, and Julia follows Proteus, the stage is set for a disturbing ending. But the stage is also set for the “gentlemen” to take small steps toward maturity. The authoritative edition of The Two Gentlemen of Verona from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes:  -Freshly edited text based on the best early printed version of the play -Full explanatory notes conveniently placed on pages facing the text of the play -Scene-by-scene plot summaries -A key to the play’s famous lines and phrases -An introduction to reading Shakespeare’s language -An essay by a leading Shakespeare scholar providing a modern perspective on the play -Fresh images from the Folger Shakespeare Library’s vast holdings of rare books -An annotated guide to further reading Essay by Jeffrey Masten The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.\n", "genres": ["Romance", "Classics", "Theatre", "British Literature", "Fiction", "Literature", "Humor", "Plays", "European Literature", "Poetry", "Drama", "Comedy"]}, "1128437": {"bookid": "1128437", "title": "Miecz przeznaczenia", "author": "Andrzej Sapkowski", "series": "(The Witcher #0.7)", "ratings": "137119", "reviews": "7681", "rating": "4.28", "description": "„Miecz przeznaczenia” jest zbiorem opowiadań stanowiących swoistą kontynuację przygód Geralta ze zbioru „Ostatnie życzenie”, a zarazem poprzedza historię opisaną w „Sadze o wiedźminie”. Generalnie opowiadania składające się na omawiany zbiór nie różnią się niczym od napisanych wcześniej. Geralt dzięki swojej sile, odwadze i inteligencji walczy z potworami bądź w inny sposó\n„Miecz przeznaczenia” jest zbiorem opowiadań stanowiących swoistą kontynuację przygód Geralta ze zbioru „Ostatnie życzenie”, a zarazem poprzedza historię opisaną w „Sadze o wiedźminie”. Generalnie opowiadania składające się na omawiany zbiór nie różnią się niczym od napisanych wcześniej. Geralt dzięki swojej sile, odwadze i inteligencji walczy z potworami bądź w inny sposób stara się pomagać ludziom. Świat, w którym rozgrywa się akcja, jest przedstawiony w sposób niezwykle plastyczny, co sprawia, iż można go sobie bez większych problemów wyobrazić. Książka przesiąknięta jest emocjami, marzeniami i wartościami. Na kartach opowiadań widzimy miłość, poświęcenie, honor, determinację spowodowaną zamiarem udzielenia pomocy ukochanemu, przywiązanie do własnej ziemi.\n", "genres": ["High Fantasy", "Adult", "Fantasy", "Polish Literature", "Fiction", "Magic", "European Literature", "Audiobook", "Epic Fantasy", "Adventure", "Short Stories"]}, "97820": {"bookid": "97820", "title": "Free to Choose: A Personal Statement", "author": "Milton Friedman", "series": "", "ratings": "8023", "reviews": "472", "rating": "4.23", "description": "INTERNATIONAL BESTSELLERA powerful and persuasive discussion about economics, freedom, and the relationship between the two, from today's brightest economist. In this classic discussion, Milton and Rose Friedman explain how our freedom has been eroded and our affluence undermined through the explosion of laws, regulations, agencies, and spending in Washington. This import\n INTERNATIONAL BESTSELLERA powerful and persuasive discussion about economics, freedom, and the relationship between the two, from today's brightest economist. In this classic discussion, Milton and Rose Friedman explain how our freedom has been eroded and our affluence undermined through the explosion of laws, regulations, agencies, and spending in Washington. This important analysis reveals what has gone wrong in America in the past and what is necessary for our economic health to flourish.\n", "genres": ["History", "Social Science", "Classics", "Philosophy", "Economics", "Finance", "Politics", "Business", "Psychology", "Nonfiction"]}, "36603432": {"bookid": "36603432", "title": "Louboutins, Lattes & Live TV", "author": "Miriam Sawan", "series": "", "ratings": "201", "reviews": "7", "rating": "4.09", "description": "Anna-Simone is a savvy television producer, desperate to find her place in lifestyle television. The colour, the madness and the manic deadlines form the perfect harmony of creative chaos she knows she can tackle. Enter Sky-High, the top-rated television network in the country, taking a chance on the ‘yes’ girl of the century. In a gut-wrenching twist of events, the talent\nAnna-Simone is a savvy television producer, desperate to find her place in lifestyle television. The colour, the madness and the manic deadlines form the perfect harmony of creative chaos she knows she can tackle. Enter Sky-High, the top-rated television network in the country, taking a chance on the ‘yes’ girl of the century. In a gut-wrenching twist of events, the talented producer meets Satan in stilettoes: a hellish nightmare of a woman who goes by the name Klarissa Maree-Francis. Well-heeled, well-spoken and a subscriber to the mean-girls group in media, Klarissa will make Anna-Simone question her very existence. From Louboutin cliques to live crosses gone wrong, Klarissa is set on making each day difficult for her team of fifteen producers – namely Anna-Simone. One by one her team will leave the battalion, shot down too many times, their brilliant ideas lying dead on the cutting room floor. See what happens when two alpha females go head to head. When women sell their souls for a promotion. Where the price of success costs you your sanity. Where the ultimate lows lead to creative highs and where out of the darkness, unlikely heroes emerge.\n", "genres": ["Teen", "Pop Culture", "Novels", "Modern", "Fiction", "Humor", "New Adult", "Culture", "Cultural", "Adventure", "Young Adult"]}, "783127": {"bookid": "783127", "title": "The 7 Habits Of Highly Effective Teens", "author": "Sean Covey", "series": "", "ratings": "32843", "reviews": "2324", "rating": "4.05", "description": "Being a teenager is both wonderful and challenging. In The 7 Habits of Highly Effective Teens, author Sean Covey applies the timeless principles of the 7 Habits to teens and the tough issues and life-changing decisions they face. In an entertaining style, Covey provides a step-by-step guide to help teens improve self-image, build friendships, resist peer pressure, achieve \nBeing a teenager is both wonderful and challenging. In The 7 Habits of Highly Effective Teens, author Sean Covey applies the timeless principles of the 7 Habits to teens and the tough issues and life-changing decisions they face. In an entertaining style, Covey provides a step-by-step guide to help teens improve self-image, build friendships, resist peer pressure, achieve their goals, get along with their parents, and much more. In addition, this book is stuffed with cartoons, clever ideas, great quotes, and incredible stories about real teens from all over the world. The 7 Habits of Highly Effective Teens will engage teenagers unlike any other book.An indispensable book for teens, as well as parents, grandparents, and any adult who influences young people, The 7 Habits of Highly Effective Teens is destined to become the last word on surviving and thriving as a teen and beyond.\n", "genres": ["Teen", "Academic", "School", "Parenting", "Education", "Personal Development", "Psychology", "Read For School", "Business", "Self Help", "Nonfiction", "Young Adult"]}, "52140091": {"bookid": "52140091", "title": "Book of Leo: Prequel to Mystical Trash", "author": "Mary Ramsey", "series": "", "ratings": "312", "reviews": "9", "rating": "4.26", "description": "Leonardo Riveria is a nomad, a trucker, and a spirt hunter. He has seen a million miles and lived a thousand lives. But in his quest to bring balance to heaven and hell, he left behind the one person who mattere", "genres": ["Novels", "Fiction", "Epic", "Thriller", "Contemporary", "Suspense"]}, "247000": {"bookid": "247000", "title": "The Mezzanine", "author": "Nicholson Baker", "series": "", "ratings": "7851", "reviews": "969", "rating": "3.85", "description": "Although most of the action of The Mezzanine occurs on the escalator of an office building, where its narrator is returning to work after buying shoelaces, this startlingly inventive and witty novel takes us farther than most fiction written today. It lends to milk cartons the associative richness of Marcel Proust's madeleines. It names the eight most significant advances \nAlthough most of the action of The Mezzanine occurs on the escalator of an office building, where its narrator is returning to work after buying shoelaces, this startlingly inventive and witty novel takes us farther than most fiction written today. It lends to milk cartons the associative richness of Marcel Proust's madeleines. It names the eight most significant advances in a human life -- beginning with shoe-tying. It asks whether the hot air blowers in bathrooms really are more sanitary than towels. And it casts a dazzling light on our relations with the objects and people we usually take for granted.\n", "genres": ["Literary Fiction", "20th Century", "Novels", "Classics", "Fiction", "Literature", "Adult Fiction", "Novella", "Contemporary", "American"]}, "24174818": {"bookid": "24174818", "title": "Moment(s)", "author": "Lisa Terry", "series": "", "ratings": "36", "reviews": "10", "rating": "3.89", "description": "They’re dying to be fans.Scottish rocker Julian McLane lives life as normally as possible. But fame can be lonely, which might be why he’d spent a year looking for the girl he caught making a wish behind the concert arena. His fans aren’t happy to share him now that he has found Emilie—too bad their violent displeasure only pushes the couple together. Emilie needs protecti\nThey’re dying to be fans.Scottish rocker Julian McLane lives life as normally as possible. But fame can be lonely, which might be why he’d spent a year looking for the girl he caught making a wish behind the concert arena. His fans aren’t happy to share him now that he has found Emilie—too bad their violent displeasure only pushes the couple together. Emilie needs protection from rabid fans, so Julian convinces her to tour with him and his prank-loving bandmates so his security team can watch over her too. Julian thinks their coupledom is as right as a love song. But something’s very wrong about murder victims wearing the band’s concert bracelets. Someone seems intent on downsizing the fandom.  Julian holds a twisted mess of clues about the killer’s identity, with every day bringing a different theory, and he’s beginning to think finding the killer means losing Emilie forever.\n", "genres": ["Romance", "New Adult", "Young Adult"]}, "41329615": {"bookid": "41329615", "title": "Trailer Trash: an '80s Memoir", "author": "Angie Cavallari", "series": "", "ratings": "174", "reviews": "68", "rating": "4.30", "description": "Trailer Trash tells the story of Angie Cavallari, your typical girl growing up in the 1980s who finds herself cradled in an arm of a society that would be considered anything but your paradigmatic suburban neighborhood. In 1980, Angie and her two siblings are dropped into a world of the poorest tenements during a decade where material wealth was worshipped. But these are n\nTrailer Trash tells the story of Angie Cavallari, your typical girl growing up in the 1980s who finds herself cradled in an arm of a society that would be considered anything but your paradigmatic suburban neighborhood. In 1980, Angie and her two siblings are dropped into a world of the poorest tenements during a decade where material wealth was worshipped. But these are not your usual run-of-the-mill Florida retirement occupants—these are tenants with issues that Angie soon realizes are the same that can happen anywhere—even under her own roof. Her place in society is further confused by the fact that she doesn’t live in a trailer but nonetheless, shares a postage-sized backyard with a less-desired community by societal standards and attends a prestigious private school more than 45 minutes from her cinderblock castle. After spending a decade living in a world of indiscernible differences, Angie’s family decides it’s time to pull up stakes, sell the trailer park and buy a double-wide trailer of their own in the Carnie Capital of World, Gibsonton, Florida. Funny at times, nostalgic throughout, Trailer Trash hits on some serious notes and undertones about societal differences and the trials of surviving childhood in any decade and any environment.\n", "genres": ["Memoir", "Autobiography", "Nonfiction"]}, "7201": {"bookid": "7201", "title": "As the Crow Flies", "author": "Jeffrey Archer", "series": "", "ratings": "21771", "reviews": "898", "rating": "4.12", "description": "Growing up in the slums of East End London, Charlie Trumper dreams of someday running his grandfather's fruit and vegetable barrow. That day comes suddenly when his grandfather dies leaving him the floundering business. With the help of Becky Salmon, an enterprising young woman, Charlie sets out to make a name for himself as \"The Honest Trader\". But the brutal onset of Wor\nGrowing up in the slums of East End London, Charlie Trumper dreams of someday running his grandfather's fruit and vegetable barrow. That day comes suddenly when his grandfather dies leaving him the floundering business. With the help of Becky Salmon, an enterprising young woman, Charlie sets out to make a name for himself as \"The Honest Trader\". But the brutal onset of World War I takes Charlie far from home and into the path of a dangerous enemy whose legacy of evil follows Charlie and his family for generations.Encompassing three continents and spanning over sixty years, As the Crow Flies brings to life a magnificent tale of one man's rise from rags to riches set against the backdrop of a changing century.\n", "genres": ["Novels", "British Literature", "Fiction", "European Literature", "Mystery Thriller", "Drama", "Historical Fiction", "Audiobook", "Thriller", "Historical", "Mystery"]}, "34942": {"bookid": "34942", "title": "The Tangle Box", "author": "Terry Brooks", "series": "(Magic Kingdom of Landover #4)", "ratings": "12676", "reviews": "169", "rating": "3.87", "description": "Troublesome magical trickster Horris Kew has unleashed a powerful evil sorcerer who's bent on ruling Landover. And that means destroying its king, Ben Holiday.\nTroublesome magical trickster Horris Kew has unleashed a powerful evil sorcerer who's bent on ruling Landover. And that means destroying its king, Ben Holiday.\n", "genres": ["High Fantasy", "Adult", "Science Fiction Fantasy", "Fantasy", "Fiction", "Humor", "Magic", "Dragons", "Epic Fantasy", "Adventure"]}}